In [1]:
import pymongo
import pandas as pd
import pickle
import datetime
import time
import gzip
import lzma
import pytz


def DB(host, db_name, user, passwd):
    auth_db = db_name if user not in ('admin', 'root') else 'admin'
    uri = 'mongodb://%s:%s@%s/?authSource=%s' % (user, passwd, host, auth_db)
    return DBObj(uri, db_name=db_name)


class DBObj(object):
    def __init__(self, uri, symbol_column='skey', db_name='white_db'):
        self.db_name = db_name
        self.uri = uri
        self.client = pymongo.MongoClient(self.uri)
        self.db = self.client[self.db_name]
        self.chunk_size = 20000
        self.symbol_column = symbol_column
        self.date_column = 'date'

    def parse_uri(self, uri):
        # mongodb://user:password@example.com
        return uri.strip().replace('mongodb://', '').strip('/').replace(':', ' ').replace('@', ' ').split(' ')

    def drop_table(self, table_name):
        self.db.drop_collection(table_name)

    def rename_table(self, old_table, new_table):
        self.db[old_table].rename(new_table)

    def write(self, table_name, df):
        if len(df) == 0: return

        multi_date = False

        if self.date_column in df.columns:
            date = str(df.head(1)[self.date_column].iloc[0])
            multi_date = len(df[self.date_column].unique()) > 1
        else:
            raise Exception('DataFrame should contain date column')

        collection = self.db[table_name]
        collection.create_index([('date', pymongo.ASCENDING), ('symbol', pymongo.ASCENDING)], background=True)
        collection.create_index([('symbol', pymongo.ASCENDING), ('date', pymongo.ASCENDING)], background=True)

        if multi_date:
            for (date, symbol), sub_df in df.groupby([self.date_column, self.symbol_column]):
                date = str(date)
                symbol = int(symbol)
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)
        else:
            for symbol, sub_df in df.groupby([self.symbol_column]):
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)

    def write_single(self, collection, date, symbol, df):
        for start in range(0, len(df), self.chunk_size):
            end = min(start + self.chunk_size, len(df))
            df_seg = df[start:end]
            version = 1
            seg = {'ver': version, 'data': self.ser(df_seg, version), 'date': date, 'symbol': symbol, 'start': start}
            collection.insert_one(seg)

    def build_query(self, start_date=None, end_date=None, symbol=None):
        query = {}

        def parse_date(x):
            if type(x) == str:
                if len(x) != 8:
                    raise Exception("`date` must be YYYYMMDD format")
                return x
            elif type(x) == datetime.datetime or type(x) == datetime.date:
                return x.strftime("%Y%m%d")
            elif type(x) == int:
                return parse_date(str(x))
            else:
                raise Exception("invalid `date` type: " + str(type(x)))

        if start_date is not None or end_date is not None:
            query['date'] = {}
            if start_date is not None:
                query['date']['$gte'] = parse_date(start_date)
            if end_date is not None:
                query['date']['$lte'] = parse_date(end_date)

        def parse_symbol(x):
            if type(x) == int:
                return x
            else:
                return int(x)

        if symbol:
            if type(symbol) == list or type(symbol) == tuple:
                query['symbol'] = {'$in': [parse_symbol(x) for x in symbol]}
            else:
                query['symbol'] = parse_symbol(symbol)

        return query

    def delete(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot delete the whole table')
            return None

        collection.delete_many(query)

    def read(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot read the whole table')
            return None

        segs = []
        for x in collection.find(query):
            x['data'] = self.deser(x['data'], x['ver'])
            segs.append(x)
        segs.sort(key=lambda x: (x['symbol'], x['date'], x['start']))
        return pd.concat([x['data'] for x in segs], ignore_index=True) if segs else None

    def list_tables(self):
        return self.db.collection_names()

    def list_dates(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]
        dates = set()
        if start_date is None:
            start_date = '00000000'
        if end_date is None:
            end_date = '99999999'
        for x in collection.find(self.build_query(start_date, end_date, symbol), {"date": 1, '_id': 0}):
            dates.add(x['date'])
        return sorted(list(dates))

    def ser(self, s, version):
        pickle_protocol = 4
        if version == 1:
            return gzip.compress(pickle.dumps(s, protocol=pickle_protocol), compresslevel=2)
        elif version == 2:
            return lzma.compress(pickle.dumps(s, protocol=pickle_protocol), preset=1)
        else:
            raise Exception('unknown version')

    def deser(self, s, version):
        def unpickle(s):
            return pickle.loads(s)

        if version == 1:
            return unpickle(gzip.decompress(s))
        elif version == 2:
            return unpickle(lzma.decompress(s))
        else:
            raise Exception('unknown version')


def patch_pandas_pickle():
    if pd.__version__ < '0.24':
        import sys
        from types import ModuleType
        from pandas.core.internals import BlockManager
        pkg_name = 'pandas.core.internals.managers'
        if pkg_name not in sys.modules:
            m = ModuleType(pkg_name)
            m.BlockManager = BlockManager
            sys.modules[pkg_name] = m
patch_pandas_pickle()
    
    


import pandas as pd
import random
import numpy as np
import glob
import os
import pickle
import datetime
import time
pd.set_option("max_columns", 200)

startTm = datetime.datetime.now()
readPath = 'A:\\day_stock\\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])
print(datetime.datetime.now() - startTm)

year = "2016"
startDate = '20160104'
endDate = '20161230'
readPath = 'L:\\' + year + '\\***\\Transaction\\SZ\\***'
dataPathLs = np.array(glob.glob(readPath))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
dataPathLs = dataPathLs[(dateLs >= startDate) & (dateLs <= endDate)]
date = np.unique(np.array([os.path.basename(i) for i in dataPathLs]))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
ll = []

for d in date: 
    TradeLog = []
    path = dataPathLs[dateLs == d]
    for p in path:
        readPath = p + '\\***'
        datapath = np.array(glob.glob(readPath))
        dd = np.array([int(os.path.basename(i).split('.')[0]) for i in datapath])
        datapath = datapath[(dd < 4000) | ((dd > 300000) & (dd < 310000))]
        for i in datapath:
            try:
                df = pd.read_csv(i, encoding='GBK')
            except:
                print("empty data")
                print(i)
                ll.append(int(os.path.basename(i).split('.')[0]))
                continue
            TradeLog += [df]
    TradeLog = pd.concat(TradeLog).reset_index(drop=True)
    
    
    TradeLog = TradeLog.rename(columns={"FunctionCode": "trade_type", "TradePrice":"trade_price", "TradeVolume":"trade_qty",
                                       "BidOrder":"BidApplSeqNum", "Date":'date', "AskOrder":"OfferApplSeqNum"})
    TradeLog['skey'] = TradeLog['WindCode'].apply(lambda x: x.split('.')[0]).astype(int) + 2000000
    TradeLog["trade_type"] = np.where(TradeLog["trade_type"] == 'C', 4, 1)
    TradeLog["trade_flag"] = 0
    TradeLog['trade_price'] = (TradeLog['trade_price'] / 10000).round(2)
    TradeLog["trade_money"] = TradeLog["trade_price"] * TradeLog["trade_qty"]
    TradeLog['TransactTime'] = (TradeLog['date'] * 1000000000).astype('int64') + TradeLog['Time']
    TradeLog = TradeLog[TradeLog["TransactTime"].astype(str).str[12:14].astype(int) < 60]
    TradeLog["clockAtArrival"] = TradeLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    TradeLog['datetime'] = TradeLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    TradeLog["time"] = TradeLog['Time'].astype(np.int64)*1000
    
    for col in ["skey", "date", "BidApplSeqNum", "OfferApplSeqNum", "trade_qty", "trade_type", "trade_flag"]:
        TradeLog[col] = TradeLog[col].astype('int32')
    for cols in ["trade_money"]:
        TradeLog[cols] = TradeLog[cols].round(2)
    
    da_te = str(TradeLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    db1 = db[db["date"] == da_te]
    sl = (db1["ID"].str[2:].astype(int) + 2000000).unique()
    db1["max_volume"] = db1.groupby("ID")["d_volume"].transform("max")
    db1["max_amount"] = db1.groupby("ID")["d_amount"].transform("max")
    t1 = db1.groupby("ID")["max_volume", "max_amount"].first().reset_index()
    del db1
    t1["skey"] = t1["ID"].str[2:].astype(int) + 2000000
    trade1 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_qty"].sum().reset_index()
    trade1.columns=["skey", "cum_volume"]
    trade2 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].sum().reset_index()
    trade2.columns=["skey", "cum_amount"]
    t2 = pd.merge(trade1, trade2, on="skey")
    re = pd.merge(t1, t2, on="skey", how="outer")
    try:
        assert(t1.shape[0] == t2.shape[0])
        assert(re[re["cum_volume"] != re["max_volume"]].shape[0] == 0)
        assert(re[re["cum_amount"].round(2) != re["max_amount"]].shape[0] == 0)
    except:
        display(set(t1["skey"]) - set(t2["skey"]))
        display(re[re["cum_volume"] != re["max_volume"]])
        display(re[re["cum_amount"].round(2) != re["max_amount"]])
    del t1
    del t2
    del re
    
    TradeLog['ApplSeqNum'] = 0
    TradeLog['ApplSeqNum'] = TradeLog['ApplSeqNum'].astype(int)
    TradeLog = TradeLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "trade_type", "trade_flag",
                                                 "trade_price", "trade_qty", "BidApplSeqNum", "OfferApplSeqNum"]]
    print(da_te)
    print("trade finished")


    
    database_name = 'com_md_eq_cn'
    user = "zhenyuy"
    password = "bnONBrzSMGoE"

    db1 = DB("192.168.10.178", database_name, user, password)
    db1.write('md_trade', TradeLog)
    
    del TradeLog

    print(datetime.datetime.now() - startTm)

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:195: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.

0:03:40.091509

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:254: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:255: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2521414.0  4.661797e+07  2001872         NaN         NaN
424  SZ001914   9803575.0  1.113733e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2521414.0  4.661797e+07  2001872         NaN         NaN
424  SZ001914   9803575.0  1.113733e+08  2001914         NaN         NaN

2016-01-04
trade finished
0:08:42.570108

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   4298268.0  7.338644e+07  2001872         NaN         NaN
423  SZ001914  17171029.0  1.760925e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   4298268.0  7.338644e+07  2001872         NaN         NaN
423  SZ001914  17171029.0  1.760925e+08  2001914         NaN         NaN

2016-01-05
trade finished
0:17:12.653472

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3,4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   2479858.0  4.287169e+07  2001872         NaN         NaN
422  SZ001914  12505733.0  1.315914e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   2479858.0  4.287169e+07  2001872         NaN         NaN
422  SZ001914  12505733.0  1.315914e+08  2001914         NaN         NaN

2016-01-06
trade finished
0:24:39.128052

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872    949100.0  15645773.00  2001872         NaN         NaN
422  SZ001914   2485100.0  25116040.28  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872    949100.0  15645773.00  2001872         NaN         NaN
422  SZ001914   2485100.0  25116040.28  2001914         NaN         NaN

2016-01-07
trade finished
0:26:43.972273

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
417  SZ001872   3332949.0  5.294867e+07  2001872         NaN         NaN
419  SZ001914  11387498.0  1.124513e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
417  SZ001872   3332949.0  5.294867e+07  2001872         NaN         NaN
419  SZ001914  11387498.0  1.124513e+08  2001914         NaN         NaN

2016-01-08
trade finished
0:35:00.387525

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
155  SZ000595  11925923.0  1.239401e+08  2000595   7306424.0  77101573.98
417  SZ001872   3881485.0  5.879512e+07  2001872         NaN          NaN
419  SZ001914  18889918.0  1.757490e+08  2001914         NaN          NaN

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
155  SZ000595  11925923.0  1.239401e+08  2000595   7306424.0  77101573.98
417  SZ001872   3881485.0  5.879512e+07  2001872         NaN          NaN
419  SZ001914  18889918.0  1.757490e+08  2001914         NaN          NaN

2016-01-11
trade finished
0:41:53.305683

{2001872, 2001914}

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
416   SZ001872    2798526.0  4.086675e+07  2001872          NaN           NaN
418   SZ001914   17446393.0  1.555347e+08  2001914          NaN           NaN
419   SZ001979  140577303.0  2.257678e+09  2001979  102479658.0  1.632995e+09
1368  SZ300278   14403475.0  2.756126e+08  2300278   12008565.0  2.302196e+08

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
416   SZ001872    2798526.0  4.086675e+07  2001872          NaN           NaN
418   SZ001914   17446393.0  1.555347e+08  2001914          NaN           NaN
419   SZ001979  140577303.0  2.257678e+09  2001979  102479658.0  1.632995e+09
1368  SZ300278   14403475.0  2.756126e+08  2300278   12008565.0  2.302196e+08

2016-01-12
trade finished
0:48:14.441558

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
417  SZ001872   2891904.0  43042264.54  2001872         NaN         NaN
419  SZ001914  10636885.0  96112359.47  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
417  SZ001872   2891904.0  43042264.54  2001872         NaN         NaN
419  SZ001914  10636885.0  96112359.47  2001914         NaN         NaN

2016-01-13
trade finished
0:54:49.782779

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872   2426670.0  3.539544e+07  2001872         NaN         NaN
420  SZ001914  13418622.0  1.169754e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872   2426670.0  3.539544e+07  2001872         NaN         NaN
420  SZ001914  13418622.0  1.169754e+08  2001914         NaN         NaN

2016-01-14
trade finished
1:01:32.869852

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   2996713.0  43036550.33  2001872         NaN         NaN
422  SZ001914   9855218.0  85382577.89  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   2996713.0  43036550.33  2001872         NaN         NaN
422  SZ001914   9855218.0  85382577.89  2001914         NaN         NaN

2016-01-15
trade finished
1:08:15.989997

{2001872, 2001914}

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
415   SZ001872    3191669.0  4.560280e+07  2001872          NaN           NaN
417   SZ001914   12862590.0  1.093737e+08  2001914          NaN           NaN
629   SZ002239   17200959.0  2.321203e+08  2002239   11607242.0  1.568401e+08
1394  SZ300315  173187111.0  2.045978e+09  2300315  142752699.0  1.678918e+09

            ID   max_volume    max_amount     skey   cum_volume    cum_amount
415   SZ001872    3191669.0  4.560280e+07  2001872          NaN           NaN
417   SZ001914   12862590.0  1.093737e+08  2001914          NaN           NaN
629   SZ002239   17200959.0  2.321203e+08  2002239   11607242.0  1.568401e+08
1394  SZ300315  173187111.0  2.045978e+09  2300315  142752699.0  1.678918e+09

2016-01-18
trade finished
1:14:50.933406

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   3362110.0  4.929178e+07  2001872         NaN         NaN
422  SZ001914  18591616.0  1.640986e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   3362110.0  4.929178e+07  2001872         NaN         NaN
422  SZ001914  18591616.0  1.640986e+08  2001914         NaN         NaN

2016-01-19
trade finished
1:21:52.201860

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   3210044.0  4.708108e+07  2001872         NaN         NaN
423  SZ001914  13600468.0  1.201131e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   3210044.0  4.708108e+07  2001872         NaN         NaN
423  SZ001914  13600468.0  1.201131e+08  2001914         NaN         NaN

2016-01-20
trade finished
1:29:21.281621

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   3174900.0  4.545300e+07  2001872         NaN         NaN
424  SZ001914  12916830.0  1.113391e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   3174900.0  4.545300e+07  2001872         NaN         NaN
424  SZ001914  12916830.0  1.113391e+08  2001914         NaN         NaN

2016-01-21
trade finished
1:36:25.955935

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
195  SZ000651  33631756.0  6.386748e+08  2000651  22494846.0  4.255750e+08
422  SZ001872   1629933.0  2.281580e+07  2001872         NaN           NaN
424  SZ001914  11392994.0  9.385918e+07  2001914         NaN           NaN

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
195  SZ000651  33631756.0  6.386748e+08  2000651  22494846.0  4.255750e+08
422  SZ001872   1629933.0  2.281580e+07  2001872         NaN           NaN
424  SZ001914  11392994.0  9.385918e+07  2001914         NaN           NaN

2016-01-22
trade finished
1:42:33.017693

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
423   SZ001872   1804770.0  2.556353e+07  2001872         NaN          NaN
425   SZ001914   8057206.0  6.735919e+07  2001914         NaN          NaN
1157  SZ300041   5191620.0  1.015459e+08  2300041   4234521.0  83039721.46

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
423   SZ001872   1804770.0  2.556353e+07  2001872         NaN          NaN
425   SZ001914   8057206.0  6.735919e+07  2001914         NaN          NaN
1157  SZ300041   5191620.0  1.015459e+08  2300041   4234521.0  83039721.46

2016-01-25
trade finished
1:48:15.458554

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   2820764.0  3.829415e+07  2001872         NaN         NaN
424  SZ001914  13423773.0  1.061244e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   2820764.0  3.829415e+07  2001872         NaN         NaN
424  SZ001914  13423773.0  1.061244e+08  2001914         NaN         NaN

2016-01-26
trade finished
1:54:52.638527

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
152  SZ000587   8528143.0  1.350250e+08  2000587   5153550.0  80864822.0
422  SZ001872   2592991.0  3.259306e+07  2001872         NaN         NaN
423  SZ001914  21941042.0  1.554810e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
152  SZ000587   8528143.0  1.350250e+08  2000587   5153550.0  80864822.0
422  SZ001872   2592991.0  3.259306e+07  2001872         NaN         NaN
423  SZ001914  21941042.0  1.554810e+08  2001914         NaN         NaN

2016-01-27
trade finished
2:01:17.240397

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   1752980.0  2.187011e+07  2001872         NaN         NaN
422  SZ001914  15150208.0  1.078624e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   1752980.0  2.187011e+07  2001872         NaN         NaN
422  SZ001914  15150208.0  1.078624e+08  2001914         NaN         NaN

2016-01-28
trade finished
2:06:41.386651

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
119  SZ000540  42774862.0  2.840124e+08  2000540  30568431.0  2.019778e+08
418  SZ001872   2303107.0  2.900321e+07  2001872         NaN           NaN
419  SZ001914  15348173.0  1.116780e+08  2001914         NaN           NaN

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
119  SZ000540  42774862.0  2.840124e+08  2000540  30568431.0  2.019778e+08
418  SZ001872   2303107.0  2.900321e+07  2001872         NaN           NaN
419  SZ001914  15348173.0  1.116780e+08  2001914         NaN           NaN

2016-01-29
trade finished
2:12:23.085156

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
414  SZ001872   2103332.0  26870914.41  2001872         NaN         NaN
415  SZ001914  12134093.0  88295575.44  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
414  SZ001872   2103332.0  26870914.41  2001872         NaN         NaN
415  SZ001914  12134093.0  88295575.44  2001914         NaN         NaN

2016-02-01
trade finished
2:17:12.387610

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   4045371.0  5.340212e+07  2001872         NaN         NaN
414  SZ001914  15069207.0  1.140671e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   4045371.0  5.340212e+07  2001872         NaN         NaN
414  SZ001914  15069207.0  1.140671e+08  2001914         NaN         NaN

2016-02-02
trade finished
2:23:25.505255

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   3390402.0  4.523878e+07  2001872         NaN         NaN
414  SZ001914  34737779.0  2.836104e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   3390402.0  4.523878e+07  2001872         NaN         NaN
414  SZ001914  34737779.0  2.836104e+08  2001914         NaN         NaN

2016-02-03
trade finished
2:29:05.811329

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
412  SZ001872   3857151.0  5.466620e+07  2001872         NaN           NaN
413  SZ001914  24446005.0  1.997527e+08  2001914         NaN           NaN
499  SZ002104  29889627.0  5.227199e+08  2002104  22983606.0  4.022052e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
412  SZ001872   3857151.0  5.466620e+07  2001872         NaN           NaN
413  SZ001914  24446005.0  1.997527e+08  2001914         NaN           NaN
499  SZ002104  29889627.0  5.227199e+08  2002104  22983606.0  4.022052e+08

2016-02-04
trade finished
2:35:08.663783

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
413   SZ001872   2851679.0  4.072123e+07  2001872         NaN           NaN
414   SZ001914  14704880.0  1.194652e+08  2001914         NaN           NaN
1131  SZ300022  15571652.0  1.234210e+08  2300022  12910552.0  1.021866e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
413   SZ001872   2851679.0  4.072123e+07  2001872         NaN           NaN
414   SZ001914  14704880.0  1.194652e+08  2001914         NaN           NaN
1131  SZ300022  15571652.0  1.234210e+08  2300022  12910552.0  1.021866e+08

2016-02-05
trade finished
2:40:36.265509

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
414   SZ001872   2252820.0  3.162106e+07  2001872         NaN           NaN
415   SZ001914  17055098.0  1.333306e+08  2001914         NaN           NaN
1244  SZ300149  13221018.0  1.539181e+08  2300149  12401972.0  1.442320e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
414   SZ001872   2252820.0  3.162106e+07  2001872         NaN           NaN
415   SZ001914  17055098.0  1.333306e+08  2001914         NaN           NaN
1244  SZ300149  13221018.0  1.539181e+08  2300149  12401972.0  1.442320e+08

2016-02-15
trade finished
2:45:16.920054

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
414  SZ001872   3596780.0  5.545941e+07  2001872         NaN         NaN
415  SZ001914  18542921.0  1.518500e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
414  SZ001872   3596780.0  5.545941e+07  2001872         NaN         NaN
415  SZ001914  18542921.0  1.518500e+08  2001914         NaN         NaN

2016-02-16
trade finished
2:50:51.578230

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
416  SZ001872   3551498.0  6.077712e+07  2001872         NaN         NaN
417  SZ001914  21343462.0  1.801365e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
416  SZ001872   3551498.0  6.077712e+07  2001872         NaN         NaN
417  SZ001914  21343462.0  1.801365e+08  2001914         NaN         NaN

2016-02-17
trade finished
2:57:12.785940

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
415  SZ001872   1986120.0  3.771642e+07  2001872         NaN         NaN
416  SZ001914  29476851.0  2.650456e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
415  SZ001872   1986120.0  3.771642e+07  2001872         NaN         NaN
416  SZ001914  29476851.0  2.650456e+08  2001914         NaN         NaN

2016-02-18
trade finished
3:03:49.558032

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872  24440919.0  4.833804e+08  2001872         NaN         NaN
419  SZ001914  20898868.0  1.825428e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872  24440919.0  4.833804e+08  2001872         NaN         NaN
419  SZ001914  20898868.0  1.825428e+08  2001914         NaN         NaN

2016-02-19
trade finished
3:09:33.307930

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
0     SZ000001  61773945.0  6.302515e+08  2000001  61030445.0  6.227199e+08
1     SZ000004   2247637.0  7.277221e+07  2000004   2241937.0  7.258582e+07
2     SZ000005  43466245.0  3.523405e+08  2000005  43095345.0  3.493250e+08
3     SZ000006  27105817.0  2.376230e+08  2000006  26796017.0  2.348812e+08
4     SZ000008  17880316.0  1.586744e+08  2000008  17816216.0  1.581084e+08
...        ...         ...           ...      ...         ...           ...
1555  SZ300497   2927559.0  2.750367e+08  2300497   2893559.0  2.718543e+08
1556  SZ300498   6534325.0  2.914668e+08  2300498   6504825.0  2.901378e+08
1557  SZ300499     35939.0  1.894704e+06  2300499     27339.0  1.441312e+06
1558  SZ300500     20481.0  1.201620e+06  2300500     16681.0  9.786743e+05
1559  SZ300501     10600.0  6.550800e+05  2300501      6700.0  4.140600e+05

[1529 rows x 6 columns]

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
0     SZ000001  61773945.0  6.302515e+08  2000001  61030445.0  6.227199e+08
1     SZ000004   2247637.0  7.277221e+07  2000004   2241937.0  7.258582e+07
2     SZ000005  43466245.0  3.523405e+08  2000005  43095345.0  3.493250e+08
3     SZ000006  27105817.0  2.376230e+08  2000006  26796017.0  2.348812e+08
4     SZ000008  17880316.0  1.586744e+08  2000008  17816216.0  1.581084e+08
...        ...         ...           ...      ...         ...           ...
1555  SZ300497   2927559.0  2.750367e+08  2300497   2893559.0  2.718543e+08
1556  SZ300498   6534325.0  2.914668e+08  2300498   6504825.0  2.901378e+08
1557  SZ300499     35939.0  1.894704e+06  2300499     27339.0  1.441312e+06
1558  SZ300500     20481.0  1.201620e+06  2300500     16681.0  9.786743e+05
1559  SZ300501     10600.0  6.550800e+05  2300501      6700.0  4.140600e+05

[1529 rows x 6 columns]

2016-02-22
trade finished
3:16:01.023208

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
415  SZ001872  12983605.0  2.370687e+08  2001872         NaN         NaN
416  SZ001914  13263572.0  1.173896e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
415  SZ001872  12983605.0  2.370687e+08  2001872         NaN         NaN
416  SZ001914  13263572.0  1.173896e+08  2001914         NaN         NaN

2016-02-23
trade finished
3:22:54.570446

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
412  SZ001872   9396748.0  1.698383e+08  2001872         NaN         NaN
413  SZ001914  15475153.0  1.389690e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
412  SZ001872   9396748.0  1.698383e+08  2001872         NaN         NaN
413  SZ001914  15475153.0  1.389690e+08  2001914         NaN         NaN

2016-02-24
trade finished
3:29:35.798624

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
316  SZ000839  64431616.0  9.175996e+08  2000839  40901744.0  5.945357e+08
376  SZ000938   7965413.0  5.123981e+08  2000938   4139103.0  2.723710e+08
416  SZ001872   8847126.0  1.513464e+08  2001872         NaN           NaN
417  SZ001914  16631524.0  1.408979e+08  2001914         NaN           NaN

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
316  SZ000839  64431616.0  9.175996e+08  2000839  40901744.0  5.945357e+08
376  SZ000938   7965413.0  5.123981e+08  2000938   4139103.0  2.723710e+08
416  SZ001872   8847126.0  1.513464e+08  2001872         NaN           NaN
417  SZ001914  16631524.0  1.408979e+08  2001914         NaN           NaN

2016-02-25
trade finished
3:37:09.795706

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
416  SZ001872   7129165.0  1.146315e+08  2001872         NaN         NaN
417  SZ001914  12225308.0  9.900358e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
416  SZ001872   7129165.0  1.146315e+08  2001872         NaN         NaN
417  SZ001914  12225308.0  9.900358e+07  2001914         NaN         NaN

2016-02-26
trade finished
3:43:25.595874

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   6462712.0  9.753757e+07  2001872         NaN         NaN
414  SZ001914  14912268.0  1.162242e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
413  SZ001872   6462712.0  9.753757e+07  2001872         NaN         NaN
414  SZ001914  14912268.0  1.162242e+08  2001914         NaN         NaN

2016-02-29
trade finished
3:49:02.400311

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
412  SZ001872   6627676.0  1.042316e+08  2001872         NaN           NaN
413  SZ001914  43745947.0  3.680109e+08  2001914         NaN           NaN
830  SZ002465  41200553.0  4.647799e+08  2002465  27390921.0  3.072158e+08
897  SZ002539   4382289.0  6.283786e+07  2002539   3223853.0  4.616071e+07

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
412  SZ001872   6627676.0  1.042316e+08  2001872         NaN           NaN
413  SZ001914  43745947.0  3.680109e+08  2001914         NaN           NaN
830  SZ002465  41200553.0  4.647799e+08  2002465  27390921.0  3.072158e+08
897  SZ002539   4382289.0  6.283786e+07  2002539   3223853.0  4.616071e+07

2016-03-01
trade finished
3:55:03.804004

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
414  SZ001872   7797645.0  1.268561e+08  2001872         NaN         NaN
416  SZ001914  61875547.0  5.556028e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
414  SZ001872   7797645.0  1.268561e+08  2001872         NaN         NaN
416  SZ001914  61875547.0  5.556028e+08  2001914         NaN         NaN

2016-03-02
trade finished
4:01:51.560696

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
410  SZ001872   7702934.0  1.302842e+08  2001872         NaN         NaN
412  SZ001914  60183962.0  5.906768e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
410  SZ001872   7702934.0  1.302842e+08  2001872         NaN         NaN
412  SZ001914  60183962.0  5.906768e+08  2001914         NaN         NaN

2016-03-03
trade finished
4:09:14.544253

ValueError: second must be in 0..59

In [1]:
import pymongo
import pandas as pd
import pickle
import datetime
import time
import gzip
import lzma
import pytz


def DB(host, db_name, user, passwd):
    auth_db = db_name if user not in ('admin', 'root') else 'admin'
    uri = 'mongodb://%s:%s@%s/?authSource=%s' % (user, passwd, host, auth_db)
    return DBObj(uri, db_name=db_name)


class DBObj(object):
    def __init__(self, uri, symbol_column='skey', db_name='white_db'):
        self.db_name = db_name
        self.uri = uri
        self.client = pymongo.MongoClient(self.uri)
        self.db = self.client[self.db_name]
        self.chunk_size = 20000
        self.symbol_column = symbol_column
        self.date_column = 'date'

    def parse_uri(self, uri):
        # mongodb://user:password@example.com
        return uri.strip().replace('mongodb://', '').strip('/').replace(':', ' ').replace('@', ' ').split(' ')

    def drop_table(self, table_name):
        self.db.drop_collection(table_name)

    def rename_table(self, old_table, new_table):
        self.db[old_table].rename(new_table)

    def write(self, table_name, df):
        if len(df) == 0: return

        multi_date = False

        if self.date_column in df.columns:
            date = str(df.head(1)[self.date_column].iloc[0])
            multi_date = len(df[self.date_column].unique()) > 1
        else:
            raise Exception('DataFrame should contain date column')

        collection = self.db[table_name]
        collection.create_index([('date', pymongo.ASCENDING), ('symbol', pymongo.ASCENDING)], background=True)
        collection.create_index([('symbol', pymongo.ASCENDING), ('date', pymongo.ASCENDING)], background=True)

        if multi_date:
            for (date, symbol), sub_df in df.groupby([self.date_column, self.symbol_column]):
                date = str(date)
                symbol = int(symbol)
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)
        else:
            for symbol, sub_df in df.groupby([self.symbol_column]):
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)

    def write_single(self, collection, date, symbol, df):
        for start in range(0, len(df), self.chunk_size):
            end = min(start + self.chunk_size, len(df))
            df_seg = df[start:end]
            version = 1
            seg = {'ver': version, 'data': self.ser(df_seg, version), 'date': date, 'symbol': symbol, 'start': start}
            collection.insert_one(seg)

    def build_query(self, start_date=None, end_date=None, symbol=None):
        query = {}

        def parse_date(x):
            if type(x) == str:
                if len(x) != 8:
                    raise Exception("`date` must be YYYYMMDD format")
                return x
            elif type(x) == datetime.datetime or type(x) == datetime.date:
                return x.strftime("%Y%m%d")
            elif type(x) == int:
                return parse_date(str(x))
            else:
                raise Exception("invalid `date` type: " + str(type(x)))

        if start_date is not None or end_date is not None:
            query['date'] = {}
            if start_date is not None:
                query['date']['$gte'] = parse_date(start_date)
            if end_date is not None:
                query['date']['$lte'] = parse_date(end_date)

        def parse_symbol(x):
            if type(x) == int:
                return x
            else:
                return int(x)

        if symbol:
            if type(symbol) == list or type(symbol) == tuple:
                query['symbol'] = {'$in': [parse_symbol(x) for x in symbol]}
            else:
                query['symbol'] = parse_symbol(symbol)

        return query

    def delete(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot delete the whole table')
            return None

        collection.delete_many(query)

    def read(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot read the whole table')
            return None

        segs = []
        for x in collection.find(query):
            x['data'] = self.deser(x['data'], x['ver'])
            segs.append(x)
        segs.sort(key=lambda x: (x['symbol'], x['date'], x['start']))
        return pd.concat([x['data'] for x in segs], ignore_index=True) if segs else None

    def list_tables(self):
        return self.db.collection_names()

    def list_dates(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]
        dates = set()
        if start_date is None:
            start_date = '00000000'
        if end_date is None:
            end_date = '99999999'
        for x in collection.find(self.build_query(start_date, end_date, symbol), {"date": 1, '_id': 0}):
            dates.add(x['date'])
        return sorted(list(dates))

    def ser(self, s, version):
        pickle_protocol = 4
        if version == 1:
            return gzip.compress(pickle.dumps(s, protocol=pickle_protocol), compresslevel=2)
        elif version == 2:
            return lzma.compress(pickle.dumps(s, protocol=pickle_protocol), preset=1)
        else:
            raise Exception('unknown version')

    def deser(self, s, version):
        def unpickle(s):
            return pickle.loads(s)

        if version == 1:
            return unpickle(gzip.decompress(s))
        elif version == 2:
            return unpickle(lzma.decompress(s))
        else:
            raise Exception('unknown version')


def patch_pandas_pickle():
    if pd.__version__ < '0.24':
        import sys
        from types import ModuleType
        from pandas.core.internals import BlockManager
        pkg_name = 'pandas.core.internals.managers'
        if pkg_name not in sys.modules:
            m = ModuleType(pkg_name)
            m.BlockManager = BlockManager
            sys.modules[pkg_name] = m
patch_pandas_pickle()
    
    


import pandas as pd
import random
import numpy as np
import glob
import os
import pickle
import datetime
import time
pd.set_option("max_columns", 200)

startTm = datetime.datetime.now()
readPath = 'A:\\day_stock\\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])
print(datetime.datetime.now() - startTm)

year = "2016"
startDate = '20160222'
endDate = '20160222'
readPath = 'L:\\' + year + '\\***\\Transaction\\SZ\\***'
dataPathLs = np.array(glob.glob(readPath))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
dataPathLs = dataPathLs[(dateLs >= startDate) & (dateLs <= endDate)]
date = np.unique(np.array([os.path.basename(i) for i in dataPathLs]))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
ll = []
problems = []

for d in date: 
    TradeLog = []
    path = dataPathLs[dateLs == d]
    for p in path:
        readPath = p + '\\***'
        datapath = np.array(glob.glob(readPath))
        dd = np.array([int(os.path.basename(i).split('.')[0]) for i in datapath])
        datapath = datapath[(dd < 4000) | ((dd > 300000) & (dd < 310000))]
        for i in datapath:
            try:
                df = pd.read_csv(i, encoding='GBK')
            except:
                print("empty data")
                print(i)
                ll.append(int(os.path.basename(i).split('.')[0]))
                continue
            TradeLog += [df]
    TradeLog = pd.concat(TradeLog).reset_index(drop=True)
    
    
    TradeLog = TradeLog.rename(columns={"FunctionCode": "trade_type", "TradePrice":"trade_price", "TradeVolume":"trade_qty",
                                       "BidOrder":"BidApplSeqNum", "Date":'date', "AskOrder":"OfferApplSeqNum"})
    TradeLog['skey'] = TradeLog['WindCode'].apply(lambda x: x.split('.')[0]).astype(int) + 2000000
    TradeLog["trade_type"] = np.where(TradeLog["trade_type"] == 'C', 4, 1)
    TradeLog["trade_flag"] = 0
    TradeLog['trade_price'] = (TradeLog['trade_price'] / 10000).round(2)
    TradeLog["trade_money"] = TradeLog["trade_price"] * TradeLog["trade_qty"]
    TradeLog['TransactTime'] = (TradeLog['date'] * 1000000000).astype('int64') + TradeLog['Time']
    TradeLog = TradeLog[TradeLog["TransactTime"].astype(str).str[12:14].astype(int) < 60]
    TradeLog["clockAtArrival"] = TradeLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    TradeLog['datetime'] = TradeLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    TradeLog["time"] = TradeLog['Time'].astype(np.int64)*1000
    
    for col in ["skey", "date", "BidApplSeqNum", "OfferApplSeqNum", "trade_qty", "trade_type", "trade_flag"]:
        TradeLog[col] = TradeLog[col].astype('int32')
    for cols in ["trade_money"]:
        TradeLog[cols] = TradeLog[cols].round(2)
    
    da_te = str(TradeLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    db1 = db[db["date"] == da_te]
    sl = (db1["ID"].str[2:].astype(int) + 2000000).unique()
    db1["max_volume"] = db1.groupby("ID")["d_volume"].transform("max")
    db1["max_amount"] = db1.groupby("ID")["d_amount"].transform("max")
    t1 = db1.groupby("ID")["max_volume", "max_amount"].first().reset_index()
    del db1
    t1["skey"] = t1["ID"].str[2:].astype(int) + 2000000
    trade1 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_qty"].sum().reset_index()
    trade1.columns=["skey", "cum_volume"]
    trade2 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].sum().reset_index()
    trade2.columns=["skey", "cum_amount"]
    t2 = pd.merge(trade1, trade2, on="skey")
    re = pd.merge(t1, t2, on="skey", how="outer")
    try:
        assert(t1.shape[0] == t2.shape[0])
        assert(re[re["cum_volume"] != re["max_volume"]].shape[0] == 0)
        assert(re[re["cum_amount"].round(2) != re["max_amount"]].shape[0] == 0)
    except:
        display(set(t1["skey"]) - set(t2["skey"]))
        display(re[re["cum_volume"] != re["max_volume"]])
        display(re[re["cum_amount"].round(2) != re["max_amount"]])
        re['date'] = d
        add = TradeLog[TradeLog['skey'].isin(re[(re["cum_amount"].round(2) != re["max_amount"]) & (~re['skey'].isin([2001872, 2001914]))]['skey'].unique())].groupby('skey')['time'].max().reset_index()
        problems += [pd.merge(re[(re["cum_amount"].round(2) != re["max_amount"]) & (~re['skey'].isin([2001872, 2001914]))], add, on='skey')[['date', 'skey', 'time']]]
    del t1
    del t2
    del re
    
    TradeLog['ApplSeqNum'] = 0
    TradeLog['ApplSeqNum'] = TradeLog['ApplSeqNum'].astype(int)
    TradeLog = TradeLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "trade_type", "trade_flag",
                                                 "trade_price", "trade_qty", "BidApplSeqNum", "OfferApplSeqNum"]]
    print(da_te)
    print("trade finished")


    
    database_name = 'com_md_eq_cn'
    user = "zhenyuy"
    password = "bnONBrzSMGoE"

    db1 = DB("192.168.10.178", database_name, user, password)
    db1.write('md_trade', TradeLog)
    
    del TradeLog

    print(datetime.datetime.now() - startTm)
problems = pd.concat(problems).reset_index(drop=True)
print(problems)
problems.to_pickle(r'G:\\2016_trade_2.pkl')

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:195: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.

0:06:34.694235

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:256: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:257: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
404  SZ001872   2933250.0  4.782273e+07  2001872         NaN         NaN
406  SZ001914  16389605.0  1.357809e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
404  SZ001872   2933250.0  4.782273e+07  2001872         NaN         NaN
406  SZ001914  16389605.0  1.357809e+08  2001914         NaN         NaN

2016-05-06
trade finished
0:15:30.493149

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

{2001872, 2001914}

            ID  max_volume    max_amount     skey    cum_volume    cum_amount
0     SZ000001  41117102.0  4.283566e+08  2000001  4.111710e+09  4.283566e+10
1     SZ000005  15958087.0  1.082865e+08  2000005  1.595809e+09  1.082865e+10
2     SZ000006  15866492.0  1.190140e+08  2000006  1.586649e+09  1.190140e+10
3     SZ000008   9014717.0  9.458592e+07  2000008  9.014717e+08  9.458592e+09
4     SZ000009  52655165.0  6.617469e+08  2000009  5.265516e+09  6.617469e+10
...        ...         ...           ...      ...           ...           ...
1533  SZ300507     29500.0  1.704805e+06  2300507  2.950000e+06  1.704805e+08
1534  SZ300508    114742.0  1.145584e+07  2300508  1.147420e+07  1.145584e+09
1535  SZ300509    111428.0  5.000889e+06  2300509  1.114280e+07  5.000889e+08
1536  SZ300510      9577.0  1.865600e+05  2300510  9.577000e+05  1.865600e+07
1537  SZ300511     22032.0  7.100914e+05  2300511  2.203200e+06  7.100914e+07

[1538 rows x 6 columns]

            ID  max_volume    max_amount     skey    cum_volume    cum_amount
0     SZ000001  41117102.0  4.283566e+08  2000001  4.111710e+09  4.283566e+10
1     SZ000005  15958087.0  1.082865e+08  2000005  1.595809e+09  1.082865e+10
2     SZ000006  15866492.0  1.190140e+08  2000006  1.586649e+09  1.190140e+10
3     SZ000008   9014717.0  9.458592e+07  2000008  9.014717e+08  9.458592e+09
4     SZ000009  52655165.0  6.617469e+08  2000009  5.265516e+09  6.617469e+10
...        ...         ...           ...      ...           ...           ...
1533  SZ300507     29500.0  1.704805e+06  2300507  2.950000e+06  1.704805e+08
1534  SZ300508    114742.0  1.145584e+07  2300508  1.147420e+07  1.145584e+09
1535  SZ300509    111428.0  5.000889e+06  2300509  1.114280e+07  5.000889e+08
1536  SZ300510      9577.0  1.865600e+05  2300510  9.577000e+05  1.865600e+07
1537  SZ300511     22032.0  7.100914e+05  2300511  2.203200e+06  7.100914e+07

[1538 rows x 6 columns]

2016-05-09
trade finished
0:22:16.472840

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
404   SZ001872   1667105.0  2.559426e+07  2001872         NaN           NaN
406   SZ001914   6181734.0  4.687842e+07  2001914         NaN           NaN
1520  SZ300490  14348020.0  7.916131e+08  2300490  13577821.0  7.505221e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
404   SZ001872   1667105.0  2.559426e+07  2001872         NaN           NaN
406   SZ001914   6181734.0  4.687842e+07  2001914         NaN           NaN
1520  SZ300490  14348020.0  7.916131e+08  2300490  13577821.0  7.505221e+08

2016-05-10
trade finished
0:27:06.875326

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
405  SZ001872   1373480.0  21055914.65  2001872         NaN         NaN
407  SZ001914   4692210.0  35592939.69  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
405  SZ001872   1373480.0  21055914.65  2001872         NaN         NaN
407  SZ001914   4692210.0  35592939.69  2001914         NaN         NaN

2016-05-11
trade finished
0:32:42.135891

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
405  SZ001872   1572276.0  23289463.23  2001872         NaN         NaN
407  SZ001914   7162419.0  52358856.51  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
405  SZ001872   1572276.0  23289463.23  2001872         NaN         NaN
407  SZ001914   7162419.0  52358856.51  2001914         NaN         NaN

2016-05-12
trade finished
0:38:08.258919

{2001872, 2001914}

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
403   SZ001872   1097253.0  16423645.40  2001872         NaN          NaN
405   SZ001914   6941530.0  51152941.98  2001914         NaN          NaN
1125  SZ300029   5633242.0  60903004.33  2300029   4898342.0  53106161.53
1328  SZ300262   2483500.0  34800550.45  2300262   2253896.0  31609081.01

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
403   SZ001872   1097253.0  16423645.40  2001872         NaN          NaN
405   SZ001914   6941530.0  51152941.98  2001914         NaN          NaN
1125  SZ300029   5633242.0  60903004.33  2300029   4898342.0  53106161.53
1328  SZ300262   2483500.0  34800550.45  2300262   2253896.0  31609081.01

2016-05-13
trade finished
0:43:14.524285

{2001872, 2001914}

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
401   SZ001872   1482326.0  22419422.49  2001872         NaN          NaN
403   SZ001914   5265970.0  38964638.22  2001914         NaN          NaN
1253  SZ300177   4375829.0  53523618.94  2300177   3844725.0  46943532.38

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
401   SZ001872   1482326.0  22419422.49  2001872         NaN          NaN
403   SZ001914   5265970.0  38964638.22  2001914         NaN          NaN
1253  SZ300177   4375829.0  53523618.94  2300177   3844725.0  46943532.38

2016-05-16
trade finished
0:48:14.670781

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
267  SZ000785   4485935.0  47983841.77  2000785   3717466.0  39765154.16
403  SZ001872   1906512.0  29182864.50  2001872         NaN          NaN
405  SZ001914   6235768.0  46765525.33  2001914         NaN          NaN

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
267  SZ000785   4485935.0  47983841.77  2000785   3717466.0  39765154.16
403  SZ001872   1906512.0  29182864.50  2001872         NaN          NaN
405  SZ001914   6235768.0  46765525.33  2001914         NaN          NaN

2016-05-17
trade finished
0:54:10.268730

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
233  SZ000721  12969975.0  89546464.98  2000721   9374814.0  64188622.69
403  SZ001872   1667763.0  24920679.21  2001872         NaN          NaN
405  SZ001914   6477327.0  47096586.76  2001914         NaN          NaN

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
233  SZ000721  12969975.0  89546464.98  2000721   9374814.0  64188622.69
403  SZ001872   1667763.0  24920679.21  2001872         NaN          NaN
405  SZ001914   6477327.0  47096586.76  2001914         NaN          NaN

2016-05-18
trade finished
1:00:12.305383

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
401  SZ001872   1088098.0  1.643656e+07  2001872         NaN           NaN
403  SZ001914   4011490.0  2.919221e+07  2001914         NaN           NaN
527  SZ002139   8954670.0  1.665375e+08  2002139   7758886.0  1.445438e+08
696  SZ002335   2392060.0  9.199537e+07  2002335   2036238.0  7.846212e+07

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
401  SZ001872   1088098.0  1.643656e+07  2001872         NaN           NaN
403  SZ001914   4011490.0  2.919221e+07  2001914         NaN           NaN
527  SZ002139   8954670.0  1.665375e+08  2002139   7758886.0  1.445438e+08
696  SZ002335   2392060.0  9.199537e+07  2002335   2036238.0  7.846212e+07

2016-05-19
trade finished
1:05:50.097065

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
401  SZ001872   1006999.0  1.504730e+07  2001872         NaN          NaN
403  SZ001914   4142005.0  3.011148e+07  2001914         NaN          NaN
525  SZ002137   8307578.0  1.015991e+08  2002137   6386976.0  77836522.72

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
401  SZ001872   1006999.0  1.504730e+07  2001872         NaN          NaN
403  SZ001914   4142005.0  3.011148e+07  2001914         NaN          NaN
525  SZ002137   8307578.0  1.015991e+08  2002137   6386976.0  77836522.72

2016-05-20
trade finished
1:11:12.388312

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
399   SZ001872   1422508.0  2.157744e+07  2001872         NaN         NaN
401   SZ001914   4247814.0  3.132730e+07  2001914         NaN         NaN
1369  SZ300318   7186097.0  1.275729e+08  2300318   5438897.0  95983246.8

            ID  max_volume    max_amount     skey  cum_volume  cum_amount
399   SZ001872   1422508.0  2.157744e+07  2001872         NaN         NaN
401   SZ001914   4247814.0  3.132730e+07  2001914         NaN         NaN
1369  SZ300318   7186097.0  1.275729e+08  2300318   5438897.0  95983246.8

2016-05-23
trade finished
1:17:14.080308

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
400  SZ001872   1224124.0  1.827995e+07  2001872         NaN           NaN
402  SZ001914   3909283.0  2.847916e+07  2001914         NaN           NaN
787  SZ002431  69006256.0  7.081816e+08  2002431  56258906.0  5.780021e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
400  SZ001872   1224124.0  1.827995e+07  2001872         NaN           NaN
402  SZ001914   3909283.0  2.847916e+07  2001914         NaN           NaN
787  SZ002431  69006256.0  7.081816e+08  2002431  56258906.0  5.780021e+08

2016-05-24
trade finished
1:22:40.357725

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
401   SZ001872    884111.0  1.322550e+07  2001872         NaN           NaN
403   SZ001914   5613185.0  4.111193e+07  2001914         NaN           NaN
816   SZ002466  22087357.0  4.117124e+09  2002466  18064981.0  3.386214e+09
1158  SZ300070   9185623.0  1.399593e+08  2300070   6997737.0  1.069070e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
401   SZ001872    884111.0  1.322550e+07  2001872         NaN           NaN
403   SZ001914   5613185.0  4.111193e+07  2001914         NaN           NaN
816   SZ002466  22087357.0  4.117124e+09  2002466  18064981.0  3.386214e+09
1158  SZ300070   9185623.0  1.399593e+08  2300070   6997737.0  1.069070e+08

2016-05-25
trade finished
1:28:04.576932

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
400  SZ001872   1236059.0  18271711.58  2001872         NaN         NaN
402  SZ001914   5070101.0  36251854.21  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
400  SZ001872   1236059.0  18271711.58  2001872         NaN         NaN
402  SZ001914   5070101.0  36251854.21  2001914         NaN         NaN

2016-05-26
trade finished
1:34:18.663885

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
399  SZ001872   3254574.0  4.978308e+07  2001872         NaN           NaN
401  SZ001914   6436990.0  4.708942e+07  2001914         NaN           NaN
943  SZ002610  72392871.0  1.169792e+09  2002610  56175333.0  9.035828e+08
964  SZ002636   4862758.0  6.547026e+07  2002636   3715944.0  5.000409e+07

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
399  SZ001872   3254574.0  4.978308e+07  2001872         NaN           NaN
401  SZ001914   6436990.0  4.708942e+07  2001914         NaN           NaN
943  SZ002610  72392871.0  1.169792e+09  2002610  56175333.0  9.035828e+08
964  SZ002636   4862758.0  6.547026e+07  2002636   3715944.0  5.000409e+07

2016-05-27
trade finished
1:39:50.270411

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
398  SZ001872   1880101.0  28257447.75  2001872         NaN         NaN
400  SZ001914   4343737.0  31523164.72  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
398  SZ001872   1880101.0  28257447.75  2001872         NaN         NaN
400  SZ001914   4343737.0  31523164.72  2001914         NaN         NaN

2016-05-30
trade finished
1:44:47.898847

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
397  SZ001872   4036743.0  62055503.63  2001872         NaN         NaN
399  SZ001914   9150131.0  68062384.94  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
397  SZ001872   4036743.0  62055503.63  2001872         NaN         NaN
399  SZ001914   9150131.0  68062384.94  2001914         NaN         NaN

2016-05-31
trade finished
1:52:21.013347

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
397   SZ001872   2964262.0  4.609443e+07  2001872         NaN           NaN
399   SZ001914  13043750.0  9.933404e+07  2001914         NaN           NaN
1219  SZ300134  69732994.0  2.131522e+09  2300134  43687552.0  1.322651e+09

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
397   SZ001872   2964262.0  4.609443e+07  2001872         NaN           NaN
399   SZ001914  13043750.0  9.933404e+07  2001914         NaN           NaN
1219  SZ300134  69732994.0  2.131522e+09  2300134  43687552.0  1.322651e+09

2016-06-01
trade finished
2:00:01.046413

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
399  SZ001872   2162591.0  3.359501e+07  2001872         NaN          NaN
401  SZ001914  20093577.0  1.583250e+08  2001914         NaN          NaN
941  SZ002606   4689728.0  8.738261e+07  2002606   2424020.0  44886838.63

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
399  SZ001872   2162591.0  3.359501e+07  2001872         NaN          NaN
401  SZ001914  20093577.0  1.583250e+08  2001914         NaN          NaN
941  SZ002606   4689728.0  8.738261e+07  2002606   2424020.0  44886838.63

2016-06-02
trade finished
2:07:01.420682

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
400  SZ001872   2066636.0  3.219761e+07  2001872         NaN           NaN
401  SZ001914  14068377.0  1.118527e+08  2001914         NaN           NaN
640  SZ002268  17197664.0  5.843724e+08  2002268   7447540.0  2.498220e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
400  SZ001872   2066636.0  3.219761e+07  2001872         NaN           NaN
401  SZ001914  14068377.0  1.118527e+08  2001914         NaN           NaN
640  SZ002268  17197664.0  5.843724e+08  2002268   7447540.0  2.498220e+08

2016-06-03
trade finished
2:14:47.514612

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
387  SZ000985   3279977.0  82119086.55  2000985   2534580.0  63191014.1
399  SZ001872   1604600.0  25025097.38  2001872         NaN         NaN
400  SZ001914   8390379.0  66416476.01  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
387  SZ000985   3279977.0  82119086.55  2000985   2534580.0  63191014.1
399  SZ001872   1604600.0  25025097.38  2001872         NaN         NaN
400  SZ001914   8390379.0  66416476.01  2001914         NaN         NaN

2016-06-06
trade finished
2:21:36.625564

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
400  SZ001872   1513891.0  23430144.13  2001872         NaN         NaN
401  SZ001914   8437988.0  65859067.49  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
400  SZ001872   1513891.0  23430144.13  2001872         NaN         NaN
401  SZ001914   8437988.0  65859067.49  2001914         NaN         NaN

2016-06-07
trade finished
2:28:30.180912

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
399  SZ001872   1272440.0  1.948909e+07  2001872         NaN           NaN
400  SZ001914   5062961.0  3.938384e+07  2001914         NaN           NaN
424  SZ002024  83879087.0  9.528483e+08  2002024  65223088.0  7.404126e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
399  SZ001872   1272440.0  1.948909e+07  2001872         NaN           NaN
400  SZ001914   5062961.0  3.938384e+07  2001914         NaN           NaN
424  SZ002024  83879087.0  9.528483e+08  2002024  65223088.0  7.404126e+08

2016-06-08
trade finished
2:35:38.485753

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
374  SZ000969  23371066.0  3.474513e+08  2000969  16047216.0  2.401314e+08
397  SZ001872   2002455.0  2.993341e+07  2001872         NaN           NaN
399  SZ001914   7008601.0  5.350503e+07  2001914         NaN           NaN
532  SZ002150  16494794.0  2.449545e+08  2002150  12689851.0  1.901824e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
374  SZ000969  23371066.0  3.474513e+08  2000969  16047216.0  2.401314e+08
397  SZ001872   2002455.0  2.993341e+07  2001872         NaN           NaN
399  SZ001914   7008601.0  5.350503e+07  2001914         NaN           NaN
532  SZ002150  16494794.0  2.449545e+08  2002150  12689851.0  1.901824e+08

2016-06-13
trade finished
2:43:14.785363

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
397  SZ001872    877560.0  12895921.71  2001872         NaN          NaN
399  SZ001914   5833186.0  42830682.39  2001914         NaN          NaN
465  SZ002073   6608000.0  68973934.24  2002073   5501573.0  57474684.22
918  SZ002586   9911475.0  90437871.40  2002586   7477994.0  68323225.70

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
397  SZ001872    877560.0  12895921.71  2001872         NaN          NaN
399  SZ001914   5833186.0  42830682.39  2001914         NaN          NaN
465  SZ002073   6608000.0  68973934.24  2002073   5501573.0  57474684.22
918  SZ002586   9911475.0  90437871.40  2002586   7477994.0  68323225.70

2016-06-14
trade finished
2:49:04.846415

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
395  SZ001872   1702138.0  2.540111e+07  2001872         NaN           NaN
397  SZ001914   8708177.0  6.552031e+07  2001914         NaN           NaN
598  SZ002222  46805869.0  7.070117e+08  2002222  29688962.0  4.436234e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
395  SZ001872   1702138.0  2.540111e+07  2001872         NaN           NaN
397  SZ001914   8708177.0  6.552031e+07  2001914         NaN           NaN
598  SZ002222  46805869.0  7.070117e+08  2002222  29688962.0  4.436234e+08

2016-06-15
trade finished
2:56:24.204218

{2001872, 2001914}

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
395  SZ001872    1473710.0  2.204914e+07  2001872          NaN           NaN
397  SZ001914    5018916.0  3.764700e+07  2001914          NaN           NaN
699  SZ002340  356877063.0  3.316328e+09  2002340  259380865.0  2.417552e+09

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
395  SZ001872    1473710.0  2.204914e+07  2001872          NaN           NaN
397  SZ001914    5018916.0  3.764700e+07  2001914          NaN           NaN
699  SZ002340  356877063.0  3.316328e+09  2002340  259380865.0  2.417552e+09

2016-06-16
trade finished
3:03:32.276722

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
395   SZ001872   1939027.0  2.946124e+07  2001872         NaN           NaN
397   SZ001914   9147235.0  6.969131e+07  2001914         NaN           NaN
1085  SZ002779   5265404.0  3.422558e+08  2002779   2950642.0  1.906913e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
395   SZ001872   1939027.0  2.946124e+07  2001872         NaN           NaN
397   SZ001914   9147235.0  6.969131e+07  2001914         NaN           NaN
1085  SZ002779   5265404.0  3.422558e+08  2002779   2950642.0  1.906913e+08

2016-06-17
trade finished
3:10:28.382966

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
396  SZ001872   1279592.0  19216305.16  2001872         NaN         NaN
398  SZ001914   6727060.0  51283024.01  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
396  SZ001872   1279592.0  19216305.16  2001872         NaN         NaN
398  SZ001914   6727060.0  51283024.01  2001914         NaN         NaN

2016-06-20
trade finished
3:16:40.148589

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
397  SZ001872   1787189.0  2.706625e+07  2001872         NaN          NaN
399  SZ001914   8089173.0  6.263015e+07  2001914         NaN          NaN
836  SZ002488  18489515.0  3.902558e+08  2002488  11268119.0  240426874.3

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
397  SZ001872   1787189.0  2.706625e+07  2001872         NaN          NaN
399  SZ001914   8089173.0  6.263015e+07  2001914         NaN          NaN
836  SZ002488  18489515.0  3.902558e+08  2002488  11268119.0  240426874.3

2016-06-21
trade finished
3:23:55.534582

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
401   SZ001872   3284166.0  5.037733e+07  2001872         NaN           NaN
403   SZ001914   5107949.0  3.923067e+07  2001914         NaN           NaN
734   SZ002371  14472586.0  5.730048e+08  2002371  11437254.0  4.527371e+08
1397  SZ300326  14457311.0  3.461155e+08  2300326  10702066.0  2.537155e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
401   SZ001872   3284166.0  5.037733e+07  2001872         NaN           NaN
403   SZ001914   5107949.0  3.923067e+07  2001914         NaN           NaN
734   SZ002371  14472586.0  5.730048e+08  2002371  11437254.0  4.527371e+08
1397  SZ300326  14457311.0  3.461155e+08  2300326  10702066.0  2.537155e+08

2016-06-22
trade finished
3:30:09.860277

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
402   SZ001872   2277620.0  3.509402e+07  2001872         NaN           NaN
404   SZ001914   5193234.0  3.992732e+07  2001914         NaN           NaN
952   SZ002610  55149860.0  1.031520e+09  2002610  43130320.0  8.080794e+08
1351  SZ300268   1333996.0  2.415072e+07  2300268    776549.0  1.409698e+07

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
402   SZ001872   2277620.0  3.509402e+07  2001872         NaN           NaN
404   SZ001914   5193234.0  3.992732e+07  2001914         NaN           NaN
952   SZ002610  55149860.0  1.031520e+09  2002610  43130320.0  8.080794e+08
1351  SZ300268   1333996.0  2.415072e+07  2300268    776549.0  1.409698e+07

2016-06-23
trade finished
3:37:00.912249

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
321  SZ000882  35640933.0  1.435923e+08  2000882  22562945.0  90946599.68
402  SZ001872   2472234.0  3.748350e+07  2001872         NaN          NaN
404  SZ001914  61941879.0  5.177043e+08  2001914         NaN          NaN

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
321  SZ000882  35640933.0  1.435923e+08  2000882  22562945.0  90946599.68
402  SZ001872   2472234.0  3.748350e+07  2001872         NaN          NaN
404  SZ001914  61941879.0  5.177043e+08  2001914         NaN          NaN

2016-06-24
trade finished
3:45:21.622457

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
403   SZ001872   1873118.0  2.852910e+07  2001872         NaN           NaN
405   SZ001914  38672496.0  3.194825e+08  2001914         NaN           NaN
1490  SZ300432  25960267.0  8.955721e+08  2300432  17318921.0  5.971317e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
403   SZ001872   1873118.0  2.852910e+07  2001872         NaN           NaN
405   SZ001914  38672496.0  3.194825e+08  2001914         NaN           NaN
1490  SZ300432  25960267.0  8.955721e+08  2300432  17318921.0  5.971317e+08

2016-06-27
trade finished
3:52:19.924018

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   4184887.0  6.572439e+07  2001872         NaN         NaN
405  SZ001914  23490492.0  1.931144e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   4184887.0  6.572439e+07  2001872         NaN         NaN
405  SZ001914  23490492.0  1.931144e+08  2001914         NaN         NaN

2016-06-28
trade finished
4:00:22.586553

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
402  SZ001872   2794838.0  4.384562e+07  2001872         NaN           NaN
404  SZ001914  22898880.0  1.918398e+08  2001914         NaN           NaN
740  SZ002377   5082451.0  4.551029e+07  2002377   2961190.0  2.659052e+07
853  SZ002501  25333443.0  2.621415e+08  2002501  17132747.0  1.778787e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
402  SZ001872   2794838.0  4.384562e+07  2001872         NaN           NaN
404  SZ001914  22898880.0  1.918398e+08  2001914         NaN           NaN
740  SZ002377   5082451.0  4.551029e+07  2002377   2961190.0  2.659052e+07
853  SZ002501  25333443.0  2.621415e+08  2002501  17132747.0  1.778787e+08

2016-06-29
trade finished
4:08:17.185642

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   2769360.0  4.365608e+07  2001872         NaN         NaN
405  SZ001914  19104581.0  1.594978e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   2769360.0  4.365608e+07  2001872         NaN         NaN
405  SZ001914  19104581.0  1.594978e+08  2001914         NaN         NaN

2016-06-30
trade finished
4:15:37.078468

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   1737887.0  2.731283e+07  2001872         NaN         NaN
405  SZ001914  14293581.0  1.175604e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
403  SZ001872   1737887.0  2.731283e+07  2001872         NaN         NaN
405  SZ001914  14293581.0  1.175604e+08  2001914         NaN         NaN

2016-07-01
trade finished
4:22:38.640356

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
403   SZ001872   2770833.0  4.362537e+07  2001872         NaN           NaN
405   SZ001914  17842470.0  1.482273e+08  2001914         NaN           NaN
663   SZ002284  34701041.0  6.775774e+08  2002284  22624709.0  4.388291e+08
1363  SZ300271  12592715.0  2.372784e+08  2300271   7880138.0  1.476629e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
403   SZ001872   2770833.0  4.362537e+07  2001872         NaN           NaN
405   SZ001914  17842470.0  1.482273e+08  2001914         NaN           NaN
663   SZ002284  34701041.0  6.775774e+08  2002284  22624709.0  4.388291e+08
1363  SZ300271  12592715.0  2.372784e+08  2300271   7880138.0  1.476629e+08

2016-07-04
trade finished
4:30:18.857907

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
404  SZ001872   5628584.0  9.157321e+07  2001872         NaN           NaN
406  SZ001914  26561492.0  2.259311e+08  2001914         NaN           NaN
834  SZ002474  94824359.0  1.737928e+09  2002474  72218573.0  1.325472e+09

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
404  SZ001872   5628584.0  9.157321e+07  2001872         NaN           NaN
406  SZ001914  26561492.0  2.259311e+08  2001914         NaN           NaN
834  SZ002474  94824359.0  1.737928e+09  2002474  72218573.0  1.325472e+09

2016-07-05
trade finished
4:38:28.141189

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
405  SZ001872   2236261.0  3.605474e+07  2001872         NaN           NaN
407  SZ001914  37738786.0  3.324593e+08  2001914         NaN           NaN
526  SZ002130  24855736.0  4.099474e+08  2002130  16520457.0  2.724836e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
405  SZ001872   2236261.0  3.605474e+07  2001872         NaN           NaN
407  SZ001914  37738786.0  3.324593e+08  2001914         NaN           NaN
526  SZ002130  24855736.0  4.099474e+08  2002130  16520457.0  2.724836e+08

2016-07-06
trade finished
4:45:56.660523

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
405   SZ001872   2466844.0  3.981122e+07  2001872         NaN           NaN
425   SZ002019  29175127.0  4.593858e+08  2002019  13357665.0  2.091148e+08
1323  SZ300222  14652978.0  3.878959e+08  2300222   9921306.0  2.624855e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
405   SZ001872   2466844.0  3.981122e+07  2001872         NaN           NaN
425   SZ002019  29175127.0  4.593858e+08  2002019  13357665.0  2.091148e+08
1323  SZ300222  14652978.0  3.878959e+08  2300222   9921306.0  2.624855e+08

2016-07-07
trade finished
4:54:09.282714

{2001872}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
15   SZ000023   5507125.0  1.449400e+08  2000023   3569074.0  93552759.37
406  SZ001872   8397068.0  1.440720e+08  2001872         NaN          NaN

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
15   SZ000023   5507125.0  1.449400e+08  2000023   3569074.0  93552759.37
406  SZ001872   8397068.0  1.440720e+08  2001872         NaN          NaN

2016-07-08
trade finished
5:01:15.296738

{2001872}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
405  SZ001872   8925378.0  1.532425e+08  2001872         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
405  SZ001872   8925378.0  1.532425e+08  2001872         NaN         NaN

2016-07-11
trade finished
5:08:40.875239

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
411  SZ001872   4154953.0  70335710.95  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
411  SZ001872   4154953.0  70335710.95  2001872         NaN         NaN

2016-07-12
trade finished
5:16:37.240130

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
412  SZ001872   3175965.0  54040444.57  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
412  SZ001872   3175965.0  54040444.57  2001872         NaN         NaN

2016-07-13
trade finished
5:24:26.929371

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
413   SZ001872   2039333.0  3.442644e+07  2001872         NaN           NaN
1154  SZ300024  22721961.0  5.899349e+08  2300024  14840345.0  3.852378e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
413   SZ001872   2039333.0  3.442644e+07  2001872         NaN           NaN
1154  SZ300024  22721961.0  5.899349e+08  2300024  14840345.0  3.852378e+08

2016-07-14
trade finished
5:31:28.518325

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
414  SZ001872   2039864.0  3.458467e+07  2001872         NaN           NaN
783  SZ002407  34661198.0  1.454322e+09  2002407  24786062.0  1.039290e+09

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
414  SZ001872   2039864.0  3.458467e+07  2001872         NaN           NaN
783  SZ002407  34661198.0  1.454322e+09  2002407  24786062.0  1.039290e+09

2016-07-15
trade finished
5:38:16.051762

{2001872}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
415   SZ001872   2381157.0  3.955120e+07  2001872         NaN          NaN
1362  SZ300253  13415992.0  3.234849e+08  2300253   9599839.0  230885409.7

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
415   SZ001872   2381157.0  3.955120e+07  2001872         NaN          NaN
1362  SZ300253  13415992.0  3.234849e+08  2300253   9599839.0  230885409.7

2016-07-18
trade finished
5:44:47.171155

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
415  SZ001872   1693752.0  28124836.63  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
415  SZ001872   1693752.0  28124836.63  2001872         NaN         NaN

2016-07-19
trade finished
5:51:25.078198

{2001872}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
413  SZ001872   1075340.0  17927480.75  2001872         NaN          NaN
742  SZ002359   3758706.0  96768807.34  2002359   2189856.0  56618434.84

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
413  SZ001872   1075340.0  17927480.75  2001872         NaN          NaN
742  SZ002359   3758706.0  96768807.34  2002359   2189856.0  56618434.84

2016-07-20
trade finished
5:58:00.310627

{2001872}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
411  SZ001872   2675522.0  45357799.2  2001872         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
411  SZ001872   2675522.0  45357799.2  2001872         NaN         NaN

2016-07-21
trade finished
6:04:33.483439

{2001872}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
414   SZ001872   1904780.0  3.226022e+07  2001872         NaN          NaN
1472  SZ300385   2660505.0  1.024580e+08  2300385   2014933.0  77653138.52

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
414   SZ001872   1904780.0  3.226022e+07  2001872         NaN          NaN
1472  SZ300385   2660505.0  1.024580e+08  2300385   2014933.0  77653138.52

2016-07-22
trade finished
6:11:06.622397

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
418   SZ001872   1913623.0  3.250137e+07  2001872         NaN           NaN
437   SZ002017  12386105.0  2.091598e+08  2002017  10891849.0  1.840486e+08
1164  SZ300024  14178956.0  3.612242e+08  2300024  10493984.0  2.675600e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
418   SZ001872   1913623.0  3.250137e+07  2001872         NaN           NaN
437   SZ002017  12386105.0  2.091598e+08  2002017  10891849.0  1.840486e+08
1164  SZ300024  14178956.0  3.612242e+08  2300024  10493984.0  2.675600e+08

2016-07-25
trade finished
6:17:04.001163

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
417  SZ001872   2348473.0  4.013618e+07  2001872         NaN           NaN
967  SZ002604  45144063.0  5.791329e+08  2002604  37951700.0  4.870611e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
417  SZ001872   2348473.0  4.013618e+07  2001872         NaN           NaN
967  SZ002604  45144063.0  5.791329e+08  2002604  37951700.0  4.870611e+08

2016-07-26
trade finished
6:22:43.193308

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
420   SZ001872   5093806.0  8.615453e+07  2001872         NaN           NaN
889   SZ002512  10599672.0  1.894134e+08  2002512   5595300.0  1.010896e+08
1342  SZ300220   8288147.0  3.078295e+08  2300220   5173155.0  1.943271e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
420   SZ001872   5093806.0  8.615453e+07  2001872         NaN           NaN
889   SZ002512  10599672.0  1.894134e+08  2002512   5595300.0  1.010896e+08
1342  SZ300220   8288147.0  3.078295e+08  2300220   5173155.0  1.943271e+08

2016-07-27
trade finished
6:32:15.556335

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   3150666.0  50239438.29  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   3150666.0  50239438.29  2001872         NaN         NaN

2016-07-28
trade finished
6:38:49.401472

{2001872}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
295  SZ000813  15564153.0  2.235236e+08  2000813  13005976.0  187563915.2
420  SZ001872   1894176.0  3.030516e+07  2001872         NaN          NaN

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
295  SZ000813  15564153.0  2.235236e+08  2000813  13005976.0  187563915.2
420  SZ001872   1894176.0  3.030516e+07  2001872         NaN          NaN

2016-07-29
trade finished
6:44:26.919183

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   1951029.0  30828782.07  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   1951029.0  30828782.07  2001872         NaN         NaN

2016-08-01
trade finished
6:49:46.003127

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   1022496.0  16264933.37  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   1022496.0  16264933.37  2001872         NaN         NaN

2016-08-02
trade finished
6:54:11.449462

{2001872}

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
422   SZ001872   3352569.0  54817361.33  2001872         NaN          NaN
1167  SZ300016   4068609.0  80258586.75  2300016   3689550.0  72810051.58

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
422   SZ001872   3352569.0  54817361.33  2001872         NaN          NaN
1167  SZ300016   4068609.0  80258586.75  2300016   3689550.0  72810051.58

2016-08-03
trade finished
6:59:14.464620

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
420  SZ001872   1962428.0  3.156960e+07  2001872         NaN           NaN
422  SZ001979  31424848.0  4.798121e+08  2001979  25311166.0  3.857406e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
420  SZ001872   1962428.0  3.156960e+07  2001872         NaN           NaN
422  SZ001979  31424848.0  4.798121e+08  2001979  25311166.0  3.857406e+08

2016-08-04
trade finished
7:04:32.789629

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   3634355.0  60047495.69  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   3634355.0  60047495.69  2001872         NaN         NaN

2016-08-05
trade finished
7:09:36.554474

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2980336.0  48318759.28  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2980336.0  48318759.28  2001872         NaN         NaN

2016-08-08
trade finished
7:14:29.806529

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2113506.0  34601533.15  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2113506.0  34601533.15  2001872         NaN         NaN

2016-08-09
trade finished
7:19:52.091874

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
403  SZ000976   3659299.0  3.095089e+07  2000976   2221405.0  1.871405e+07
423  SZ001872   2295312.0  3.739044e+07  2001872         NaN           NaN
800  SZ002407  26329234.0  1.008126e+09  2002407  21292718.0  8.155346e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
403  SZ000976   3659299.0  3.095089e+07  2000976   2221405.0  1.871405e+07
423  SZ001872   2295312.0  3.739044e+07  2001872         NaN           NaN
800  SZ002407  26329234.0  1.008126e+09  2002407  21292718.0  8.155346e+08

2016-08-10
trade finished
7:25:40.001798

{2001872}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
424  SZ001872   1662800.0  26874130.2  2001872         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
424  SZ001872   1662800.0  26874130.2  2001872         NaN         NaN

2016-08-11
trade finished
7:31:05.372740

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1990780.0  32104663.06  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1990780.0  32104663.06  2001872         NaN         NaN

2016-08-12
trade finished
7:36:01.297543

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   5231716.0  86476556.29  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   5231716.0  86476556.29  2001872         NaN         NaN

2016-08-15
trade finished
7:43:18.541481

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
426   SZ001872   5091272.0  8.545131e+07  2001872         NaN           NaN
1145  SZ002793   3843100.0  2.537493e+08  2002793   2558624.0  1.694410e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
426   SZ001872   5091272.0  8.545131e+07  2001872         NaN           NaN
1145  SZ002793   3843100.0  2.537493e+08  2002793   2558624.0  1.694410e+08

2016-08-16
trade finished
7:50:19.820165

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
265   SZ000759   4573906.0  3.414605e+07  2000759   2646962.0  1.973432e+07
426   SZ001872   6079963.0  1.036935e+08  2001872         NaN           NaN
1306  SZ300160  19958918.0  2.485204e+08  2300160  14703536.0  1.819763e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
265   SZ000759   4573906.0  3.414605e+07  2000759   2646962.0  1.973432e+07
426   SZ001872   6079963.0  1.036935e+08  2001872         NaN           NaN
1306  SZ300160  19958918.0  2.485204e+08  2300160  14703536.0  1.819763e+08

2016-08-17
trade finished
7:56:57.535956

{2001872}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   6911775.0  1.180038e+08  2001872         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   6911775.0  1.180038e+08  2001872         NaN         NaN

2016-08-18
trade finished
8:03:48.782469

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   3230075.0  54958508.38  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   3230075.0  54958508.38  2001872         NaN         NaN

2016-08-19
trade finished
8:09:48.316332

{2001872}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
409  SZ000978   5334106.0  61902630.03  2000978   4087178.0  47517808.99
427  SZ001872   2775847.0  46357719.36  2001872         NaN          NaN

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
409  SZ000978   5334106.0  61902630.03  2000978   4087178.0  47517808.99
427  SZ001872   2775847.0  46357719.36  2001872         NaN          NaN

2016-08-22
trade finished
8:16:03.255022

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
428  SZ001872   1595524.0  26530962.31  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
428  SZ001872   1595524.0  26530962.31  2001872         NaN         NaN

2016-08-23
trade finished
8:21:23.830948

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
428  SZ001872   1398246.0  23336710.62  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
428  SZ001872   1398246.0  23336710.62  2001872         NaN         NaN

2016-08-24
trade finished
8:26:46.187141

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   1748192.0  28590883.07  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
426  SZ001872   1748192.0  28590883.07  2001872         NaN         NaN

2016-08-25
trade finished
8:32:39.954317

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
425   SZ001872   1312508.0  2.156499e+07  2001872         NaN           NaN
1173  SZ300012  11268739.0  1.344712e+08  2300012   8435923.0  1.005767e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
425   SZ001872   1312508.0  2.156499e+07  2001872         NaN           NaN
1173  SZ300012  11268739.0  1.344712e+08  2300012   8435923.0  1.005767e+08

2016-08-26
trade finished
8:38:21.351597

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
74   SZ000410   8824703.0  1.384769e+08  2000410   7195645.0  1.129115e+08
423  SZ001872   1079596.0  1.768951e+07  2001872         NaN           NaN
674  SZ002265   3249982.0  4.661558e+07  2002265   2788482.0  4.001366e+07

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
74   SZ000410   8824703.0  1.384769e+08  2000410   7195645.0  1.129115e+08
423  SZ001872   1079596.0  1.768951e+07  2001872         NaN           NaN
674  SZ002265   3249982.0  4.661558e+07  2002265   2788482.0  4.001366e+07

2016-08-29
trade finished
8:43:20.233556

{2001872}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   1285850.0  2.113840e+07  2001872         NaN          NaN
1240  SZ300090  26582720.0  2.525336e+08  2300090  22204869.0  211375593.7

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   1285850.0  2.113840e+07  2001872         NaN          NaN
1240  SZ300090  26582720.0  2.525336e+08  2300090  22204869.0  211375593.7

2016-08-30
trade finished
8:48:17.963681

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
424   SZ001872   1587379.0  2.610803e+07  2001872         NaN           NaN
716   SZ002312  22435947.0  2.488870e+08  2002312  18138723.0  2.010198e+08
1542  SZ300431  17243370.0  1.124912e+09  2300431  15325685.0  1.000185e+09

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
424   SZ001872   1587379.0  2.610803e+07  2001872         NaN           NaN
716   SZ002312  22435947.0  2.488870e+08  2002312  18138723.0  2.010198e+08
1542  SZ300431  17243370.0  1.124912e+09  2300431  15325685.0  1.000185e+09

2016-08-31
trade finished
8:53:28.929414

{2001872}

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
422  SZ001872   2632254.0  43742152.3  2001872         NaN         NaN

           ID  max_volume  max_amount     skey  cum_volume  cum_amount
422  SZ001872   2632254.0  43742152.3  2001872         NaN         NaN

2016-09-01
trade finished
8:59:00.792163

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2097415.0  34296386.82  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2097415.0  34296386.82  2001872         NaN         NaN

2016-09-02
trade finished
9:04:14.954404

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1075666.0  17560262.06  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1075666.0  17560262.06  2001872         NaN         NaN

2016-09-05
trade finished
9:09:08.188634

{2001872}

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
211  SZ000683  135947619.0  4.268998e+08  2000683  104062206.0  3.266600e+08
424  SZ001872    1868195.0  3.042744e+07  2001872          NaN           NaN

           ID   max_volume    max_amount     skey   cum_volume    cum_amount
211  SZ000683  135947619.0  4.268998e+08  2000683  104062206.0  3.266600e+08
424  SZ001872    1868195.0  3.042744e+07  2001872          NaN           NaN

2016-09-06
trade finished
9:15:13.582625

{2001872}

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
424   SZ001872   2788548.0  46428856.40  2001872         NaN          NaN
1433  SZ300289   4010880.0  55559726.29  2300289   2668334.0  36972943.22

            ID  max_volume   max_amount     skey  cum_volume   cum_amount
424   SZ001872   2788548.0  46428856.40  2001872         NaN          NaN
1433  SZ300289   4010880.0  55559726.29  2300289   2668334.0  36972943.22

2016-09-07
trade finished
9:21:29.380900

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
427  SZ001872   1226243.0  20333023.31  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
427  SZ001872   1226243.0  20333023.31  2001872         NaN         NaN

2016-09-08
trade finished
9:26:49.461055

{2001872}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
427   SZ001872   1146541.0  1.897816e+07  2001872         NaN          NaN
1469  SZ300339   3586498.0  1.188260e+08  2300339   2418354.0  80456218.93

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
427   SZ001872   1146541.0  1.897816e+07  2001872         NaN          NaN
1469  SZ300339   3586498.0  1.188260e+08  2300339   2418354.0  80456218.93

2016-09-09
trade finished
9:32:35.267588

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   2101991.0  34054316.18  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   2101991.0  34054316.18  2001872         NaN         NaN

2016-09-12
trade finished
9:38:33.439061

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
423   SZ001872   1407688.0  2.280719e+07  2001872         NaN           NaN
820   SZ002425   6556595.0  1.542077e+08  2002425   5528095.0  1.296424e+08
1547  SZ300440  13045718.0  4.422469e+08  2300440  11657428.0  3.940011e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
423   SZ001872   1407688.0  2.280719e+07  2001872         NaN           NaN
820   SZ002425   6556595.0  1.542077e+08  2002425   5528095.0  1.296424e+08
1547  SZ300440  13045718.0  4.422469e+08  2300440  11657428.0  3.940011e+08

2016-09-13
trade finished
9:43:13.984986

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
422  SZ001872    897372.0  1.454989e+07  2001872         NaN           NaN
708  SZ002307   8346249.0  7.267657e+07  2002307   7859949.0  6.847483e+07
720  SZ002320  23897042.0  3.833375e+08  2002320  22911461.0  3.680336e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
422  SZ001872    897372.0  1.454989e+07  2001872         NaN           NaN
708  SZ002307   8346249.0  7.267657e+07  2002307   7859949.0  6.847483e+07
720  SZ002320  23897042.0  3.833375e+08  2002320  22911461.0  3.680336e+08

2016-09-14
trade finished
9:47:46.426761

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   1442153.0  23735585.56  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   1442153.0  23735585.56  2001872         NaN         NaN

2016-09-19
trade finished
9:51:55.131980

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   1004766.0  16510376.16  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   1004766.0  16510376.16  2001872         NaN         NaN

2016-09-20
trade finished
9:56:17.785833

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
182  SZ000637  68811677.0  5.648931e+08  2000637  67105577.0  5.508509e+08
417  SZ001872   5410554.0  9.100516e+07  2001872         NaN           NaN

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
182  SZ000637  68811677.0  5.648931e+08  2000637  67105577.0  5.508509e+08
417  SZ001872   5410554.0  9.100516e+07  2001872         NaN           NaN

2016-09-21
trade finished
10:00:48.175015

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   3605374.0  61264546.06  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   3605374.0  61264546.06  2001872         NaN         NaN

2016-09-22
trade finished
10:05:41.146719

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   2194774.0  37112538.02  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
420  SZ001872   2194774.0  37112538.02  2001872         NaN         NaN

2016-09-23
trade finished
10:10:32.815027

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2675784.0  45362390.85  2001872         NaN         NaN
483  SZ002064   8255084.0  38948843.12  2002064   5690590.0  26915311.0

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   2675784.0  45362390.85  2001872         NaN         NaN
483  SZ002064   8255084.0  38948843.12  2002064   5690590.0  26915311.0

2016-09-26
trade finished
10:15:56.231492

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
421   SZ001872   1858109.0  3.090699e+07  2001872         NaN           NaN
745   SZ002351  15661946.0  1.844817e+08  2002351  14726746.0  1.733745e+08
1632  SZ300538   4656040.0  4.259759e+08  2300538   4368890.0  3.990096e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
421   SZ001872   1858109.0  3.090699e+07  2001872         NaN           NaN
745   SZ002351  15661946.0  1.844817e+08  2002351  14726746.0  1.733745e+08
1632  SZ300538   4656040.0  4.259759e+08  2300538   4368890.0  3.990096e+08

2016-09-27
trade finished
10:20:22.364109

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1864619.0  31444800.31  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1864619.0  31444800.31  2001872         NaN         NaN

2016-09-28
trade finished
10:24:31.536890

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
423  SZ001872   1906934.0  32211442.28  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
423  SZ001872   1906934.0  32211442.28  2001872         NaN         NaN

2016-09-29
trade finished
10:28:41.697061

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   1427703.0  23987100.31  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
422  SZ001872   1427703.0  23987100.31  2001872         NaN         NaN

2016-09-30
trade finished
10:32:31.676132

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
418  SZ001872   3409252.0  5.777442e+07  2001872         NaN           NaN
595  SZ002192   6424094.0  1.799812e+08  2002192   5425631.0  1.519002e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
418  SZ001872   3409252.0  5.777442e+07  2001872         NaN           NaN
595  SZ002192   6424094.0  1.799812e+08  2002192   5425631.0  1.519002e+08

2016-10-10
trade finished
10:37:27.722551

{2001872}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
420   SZ001872   6860097.0  1.204366e+08  2001872         NaN           NaN
907   SZ002528   5348188.0  4.356020e+07  2002528   4530363.0  3.689237e+07
1229  SZ300083  17001734.0  1.283780e+08  2300083  14781875.0  1.116559e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
420   SZ001872   6860097.0  1.204366e+08  2001872         NaN           NaN
907   SZ002528   5348188.0  4.356020e+07  2002528   4530363.0  3.689237e+07
1229  SZ300083  17001734.0  1.283780e+08  2300083  14781875.0  1.116559e+08

2016-10-11
trade finished
10:42:32.921495

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
423  SZ001872   3333581.0  57664446.01  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
423  SZ001872   3333581.0  57664446.01  2001872         NaN         NaN

2016-10-12
trade finished
10:47:36.418990

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
424  SZ001872   2230959.0  3.864473e+07  2001872         NaN           NaN
910  SZ002521  19456199.0  2.107293e+08  2002521  17854810.0  1.934508e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
424  SZ001872   2230959.0  3.864473e+07  2001872         NaN           NaN
910  SZ002521  19456199.0  2.107293e+08  2002521  17854810.0  1.934508e+08

2016-10-13
trade finished
10:52:44.115324

{2001872}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
423  SZ001872   2247551.0  3.844675e+07  2001872         NaN           NaN
548  SZ002134  43741510.0  7.144846e+08  2002134  41350743.0  6.757490e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
423  SZ001872   2247551.0  3.844675e+07  2001872         NaN           NaN
548  SZ002134  43741510.0  7.144846e+08  2002134  41350743.0  6.757490e+08

2016-10-14
trade finished
10:57:47.160092

{2001872}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   2169901.0  3.698890e+07  2001872         NaN          NaN
432   SZ002006   5485610.0  7.171034e+07  2002006   4694004.0  61474199.10
1012  SZ002637   8402574.0  1.205371e+08  2002637   6553560.0  94067669.37

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   2169901.0  3.698890e+07  2001872         NaN          NaN
432   SZ002006   5485610.0  7.171034e+07  2002006   4694004.0  61474199.10
1012  SZ002637   8402574.0  1.205371e+08  2002637   6553560.0  94067669.37

2016-10-17
trade finished
11:03:10.685005

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1896869.0  32229979.63  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   1896869.0  32229979.63  2001872         NaN         NaN

2016-10-18
trade finished
11:08:34.732710

{2001872}

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
424  SZ001872   2629252.0  44837577.33  2001872         NaN          NaN
852  SZ002455   8331629.0  81271775.19  2002455   6150764.0  59863583.52

           ID  max_volume   max_amount     skey  cum_volume   cum_amount
424  SZ001872   2629252.0  44837577.33  2001872         NaN          NaN
852  SZ002455   8331629.0  81271775.19  2002455   6150764.0  59863583.52

2016-10-19
trade finished
11:14:18.075725

{2001872}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   2132231.0  36154076.54  2001872         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
421  SZ001872   2132231.0  36154076.54  2001872         NaN         NaN

2016-10-20
trade finished
11:20:24.359684

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
422  SZ001872   3062217.0  5.256462e+07  2001872         NaN           NaN
424  SZ001914   1170668.0  1.102769e+07  2001914         NaN           NaN
709  SZ002310  36685018.0  5.977465e+08  2002310  27242037.0  4.431396e+08
962  SZ002590  11357903.0  2.890919e+08  2002590   8817626.0  2.249611e+08

           ID  max_volume    max_amount     skey  cum_volume    cum_amount
422  SZ001872   3062217.0  5.256462e+07  2001872         NaN           NaN
424  SZ001914   1170668.0  1.102769e+07  2001914         NaN           NaN
709  SZ002310  36685018.0  5.977465e+08  2002310  27242037.0  4.431396e+08
962  SZ002590  11357903.0  2.890919e+08  2002590   8817626.0  2.249611e+08

2016-10-21
trade finished
11:26:44.312422

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   2728744.0  4.693311e+07  2001872         NaN          NaN
426   SZ001914  38085875.0  3.898552e+08  2001914         NaN          NaN
1386  SZ300248   3449836.0  8.240311e+07  2300248   2688462.0  64166758.37

            ID  max_volume    max_amount     skey  cum_volume   cum_amount
424   SZ001872   2728744.0  4.693311e+07  2001872         NaN          NaN
426   SZ001914  38085875.0  3.898552e+08  2001914         NaN          NaN
1386  SZ300248   3449836.0  8.240311e+07  2300248   2688462.0  64166758.37

2016-10-24
trade finished
11:32:51.508596

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2248955.0  3.854111e+07  2001872         NaN         NaN
426  SZ001914  72586781.0  7.890715e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2248955.0  3.854111e+07  2001872         NaN         NaN
426  SZ001914  72586781.0  7.890715e+08  2001914         NaN         NaN

2016-10-25
trade finished
11:39:06.965867

{2001872, 2001914}

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
426   SZ001872   2415031.0  4.095088e+07  2001872         NaN           NaN
428   SZ001914  53471648.0  5.851171e+08  2001914         NaN           NaN
1572  SZ300441   7751160.0  2.116838e+08  2300441   5799532.0  1.588419e+08

            ID  max_volume    max_amount     skey  cum_volume    cum_amount
426   SZ001872   2415031.0  4.095088e+07  2001872         NaN           NaN
428   SZ001914  53471648.0  5.851171e+08  2001914         NaN           NaN
1572  SZ300441   7751160.0  2.116838e+08  2300441   5799532.0  1.588419e+08

2016-10-26
trade finished
11:45:20.552833

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
149  SZ000589   7578995.0  4.467257e+07  2000589   6156778.0  36285230.24
425  SZ001872   1653649.0  2.781185e+07  2001872         NaN          NaN
427  SZ001914  36109774.0  3.765376e+08  2001914         NaN          NaN
445  SZ002017   3521113.0  5.377336e+07  2002017   2777972.0  42365962.93

           ID  max_volume    max_amount     skey  cum_volume   cum_amount
149  SZ000589   7578995.0  4.467257e+07  2000589   6156778.0  36285230.24
425  SZ001872   1653649.0  2.781185e+07  2001872         NaN          NaN
427  SZ001914  36109774.0  3.765376e+08  2001914         NaN          NaN
445  SZ002017   3521113.0  5.377336e+07  2002017   2777972.0  42365962.93

2016-10-27
trade finished
11:50:33.669697

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2219601.0  3.745536e+07  2001872         NaN         NaN
426  SZ001914  36666303.0  3.870620e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2219601.0  3.745536e+07  2001872         NaN         NaN
426  SZ001914  36666303.0  3.870620e+08  2001914         NaN         NaN

2016-10-28
trade finished
11:56:17.845489

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   2458904.0  4.200290e+07  2001872         NaN         NaN
429  SZ001914  19892468.0  2.083165e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   2458904.0  4.200290e+07  2001872         NaN         NaN
429  SZ001914  19892468.0  2.083165e+08  2001914         NaN         NaN

2016-10-31
trade finished
12:01:13.076056

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2258610.0  3.844691e+07  2001872         NaN         NaN
426  SZ001914  32738266.0  3.503726e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2258610.0  3.844691e+07  2001872         NaN         NaN
426  SZ001914  32738266.0  3.503726e+08  2001914         NaN         NaN

2016-11-01
trade finished
12:06:29.038374

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2246392.0  3.793341e+07  2001872         NaN         NaN
426  SZ001914  37039479.0  3.991857e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2246392.0  3.793341e+07  2001872         NaN         NaN
426  SZ001914  37039479.0  3.991857e+08  2001914         NaN         NaN

2016-11-02
trade finished
12:12:50.990383

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   1529631.0  2.586964e+07  2001872         NaN         NaN
427  SZ001914  69519469.0  7.984855e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   1529631.0  2.586964e+07  2001872         NaN         NaN
427  SZ001914  69519469.0  7.984855e+08  2001914         NaN         NaN

2016-11-03
trade finished
12:19:51.999732

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   2218307.0  3.773285e+07  2001872         NaN         NaN
428  SZ001914  43561393.0  4.852216e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   2218307.0  3.773285e+07  2001872         NaN         NaN
428  SZ001914  43561393.0  4.852216e+08  2001914         NaN         NaN

2016-11-04
trade finished
12:26:04.752195

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   2070341.0  3.500030e+07  2001872         NaN         NaN
427  SZ001914  24266718.0  2.622785e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   2070341.0  3.500030e+07  2001872         NaN         NaN
427  SZ001914  24266718.0  2.622785e+08  2001914         NaN         NaN

2016-11-07
trade finished
12:31:48.578311

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2202202.0  3.727972e+07  2001872         NaN         NaN
424  SZ001914  21322847.0  2.263136e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2202202.0  3.727972e+07  2001872         NaN         NaN
424  SZ001914  21322847.0  2.263136e+08  2001914         NaN         NaN

2016-11-08
trade finished
12:37:28.393261

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   1753890.0  2.959539e+07  2001872         NaN         NaN
423  SZ001914  24788806.0  2.634215e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   1753890.0  2.959539e+07  2001872         NaN         NaN
423  SZ001914  24788806.0  2.634215e+08  2001914         NaN         NaN

2016-11-09
trade finished
12:44:13.573880

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   4743588.0  8.138141e+07  2001872         NaN         NaN
423  SZ001914  22372531.0  2.416966e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   4743588.0  8.138141e+07  2001872         NaN         NaN
423  SZ001914  22372531.0  2.416966e+08  2001914         NaN         NaN

2016-11-10
trade finished
12:50:32.284731

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   3459773.0  5.966348e+07  2001872         NaN         NaN
423  SZ001914  20409774.0  2.172855e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   3459773.0  5.966348e+07  2001872         NaN         NaN
423  SZ001914  20409774.0  2.172855e+08  2001914         NaN         NaN

2016-11-11
trade finished
12:57:30.747978

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   5976733.0  1.042385e+08  2001872         NaN         NaN
422  SZ001914  21117575.0  2.261690e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   5976733.0  1.042385e+08  2001872         NaN         NaN
422  SZ001914  21117575.0  2.261690e+08  2001914         NaN         NaN

2016-11-14
trade finished
13:04:30.763578

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   7528484.0  1.338578e+08  2001872         NaN         NaN
422  SZ001914  21961790.0  2.412878e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
420  SZ001872   7528484.0  1.338578e+08  2001872         NaN         NaN
422  SZ001914  21961790.0  2.412878e+08  2001914         NaN         NaN

2016-11-15
trade finished
13:11:08.595007

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   5416948.0  9.515630e+07  2001872         NaN         NaN
423  SZ001914  13111015.0  1.423448e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
421  SZ001872   5416948.0  9.515630e+07  2001872         NaN         NaN
423  SZ001914  13111015.0  1.423448e+08  2001914         NaN         NaN

2016-11-16
trade finished
13:18:03.584465

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
419  SZ001872   4538347.0  8.125668e+07  2001872         NaN         NaN
421  SZ001914  28190821.0  3.156277e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
419  SZ001872   4538347.0  8.125668e+07  2001872         NaN         NaN
421  SZ001914  28190821.0  3.156277e+08  2001914         NaN         NaN

2016-11-17
trade finished
13:23:57.832500

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872   3134748.0  5.458319e+07  2001872         NaN         NaN
420  SZ001914  13116941.0  1.449661e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
418  SZ001872   3134748.0  5.458319e+07  2001872         NaN         NaN
420  SZ001914  13116941.0  1.449661e+08  2001914         NaN         NaN

2016-11-18
trade finished
13:29:43.048966

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2365015.0  4.102353e+07  2001872         NaN         NaN
424  SZ001914  15187913.0  1.644338e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   2365015.0  4.102353e+07  2001872         NaN         NaN
424  SZ001914  15187913.0  1.644338e+08  2001914         NaN         NaN

2016-11-21
trade finished
13:35:33.162023

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   1854202.0  3.222712e+07  2001872         NaN         NaN
425  SZ001914  10992026.0  1.191734e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   1854202.0  3.222712e+07  2001872         NaN         NaN
425  SZ001914  10992026.0  1.191734e+08  2001914         NaN         NaN

2016-11-22
trade finished
13:41:45.751332

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2731260.0  4.766809e+07  2001872         NaN         NaN
426  SZ001914  14934332.0  1.617926e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2731260.0  4.766809e+07  2001872         NaN         NaN
426  SZ001914  14934332.0  1.617926e+08  2001914         NaN         NaN

2016-11-23
trade finished
13:48:41.089900

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2770109.0  4.874897e+07  2001872         NaN         NaN
426  SZ001914  13555184.0  1.439994e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   2770109.0  4.874897e+07  2001872         NaN         NaN
426  SZ001914  13555184.0  1.439994e+08  2001914         NaN         NaN

2016-11-24
trade finished
13:55:04.901168

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
425  SZ001872   2110773.0  36841420.62  2001872         NaN         NaN
427  SZ001914   8252729.0  86974047.03  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
425  SZ001872   2110773.0  36841420.62  2001872         NaN         NaN
427  SZ001914   8252729.0  86974047.03  2001914         NaN         NaN

2016-11-25
trade finished
14:01:29.416541

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   7494738.0  1.414031e+08  2001872         NaN         NaN
426  SZ001914   8794466.0  9.404067e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   7494738.0  1.414031e+08  2001872         NaN         NaN
426  SZ001914   8794466.0  9.404067e+07  2001914         NaN         NaN

2016-11-28
trade finished
14:07:26.019659

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872  27057666.0  5.519935e+08  2001872         NaN         NaN
425  SZ001914  14813434.0  1.603616e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872  27057666.0  5.519935e+08  2001872         NaN         NaN
425  SZ001914  14813434.0  1.603616e+08  2001914         NaN         NaN

2016-11-29
trade finished
14:13:46.254956

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872  17791959.0  3.562744e+08  2001872         NaN         NaN
425  SZ001914  18706150.0  1.927413e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872  17791959.0  3.562744e+08  2001872         NaN         NaN
425  SZ001914  18706150.0  1.927413e+08  2001914         NaN         NaN

2016-11-30
trade finished
14:19:33.240293

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872  13009561.0  2.670547e+08  2001872         NaN         NaN
427  SZ001914   7928107.0  8.131436e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872  13009561.0  2.670547e+08  2001872         NaN         NaN
427  SZ001914   7928107.0  8.131436e+07  2001914         NaN         NaN

2016-12-01
trade finished
14:24:56.472025

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   9406429.0  1.859607e+08  2001872         NaN         NaN
427  SZ001914   6590868.0  6.768949e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   9406429.0  1.859607e+08  2001872         NaN         NaN
427  SZ001914   6590868.0  6.768949e+07  2001914         NaN         NaN

2016-12-02
trade finished
14:30:53.696674

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8644223.0  1.697790e+08  2001872         NaN         NaN
425  SZ001914   6412089.0  6.554857e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8644223.0  1.697790e+08  2001872         NaN         NaN
425  SZ001914   6412089.0  6.554857e+07  2001914         NaN         NaN

2016-12-05
trade finished
14:36:27.538846

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8220096.0  1.573761e+08  2001872         NaN         NaN
425  SZ001914   6290289.0  6.432237e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8220096.0  1.573761e+08  2001872         NaN         NaN
425  SZ001914   6290289.0  6.432237e+07  2001914         NaN         NaN

2016-12-06
trade finished
14:41:30.448252

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8683337.0  1.670498e+08  2001872         NaN         NaN
425  SZ001914  10118545.0  1.040574e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   8683337.0  1.670498e+08  2001872         NaN         NaN
425  SZ001914  10118545.0  1.040574e+08  2001914         NaN         NaN

2016-12-07
trade finished
14:46:54.731792

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   6699516.0  1.307221e+08  2001872         NaN         NaN
425  SZ001914  14205908.0  1.498315e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   6699516.0  1.307221e+08  2001872         NaN         NaN
425  SZ001914  14205908.0  1.498315e+08  2001914         NaN         NaN

2016-12-08
trade finished
14:52:29.668067

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   6943684.0  1.363655e+08  2001872         NaN         NaN
425  SZ001914  12013962.0  1.282129e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   6943684.0  1.363655e+08  2001872         NaN         NaN
425  SZ001914  12013962.0  1.282129e+08  2001914         NaN         NaN

2016-12-09
trade finished
14:57:58.362332

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   7109241.0  1.334081e+08  2001872         NaN         NaN
425  SZ001914  11799129.0  1.211015e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
423  SZ001872   7109241.0  1.334081e+08  2001872         NaN         NaN
425  SZ001914  11799129.0  1.211015e+08  2001914         NaN         NaN

2016-12-12
trade finished
15:05:05.223477

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   4695950.0  86936403.99  2001872         NaN         NaN
426  SZ001914   6448204.0  64708761.37  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   4695950.0  86936403.99  2001872         NaN         NaN
426  SZ001914   6448204.0  64708761.37  2001914         NaN         NaN

2016-12-13
trade finished
15:10:36.882574

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   6048046.0  1.137182e+08  2001872         NaN         NaN
428  SZ001914   6089624.0  6.159740e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   6048046.0  1.137182e+08  2001872         NaN         NaN
428  SZ001914   6089624.0  6.159740e+07  2001914         NaN         NaN

2016-12-14
trade finished
15:15:58.475993

{2001872, 2001914}

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   4481541.0  84902793.88  2001872         NaN         NaN
426  SZ001914   5992060.0  61162179.75  2001914         NaN         NaN

           ID  max_volume   max_amount     skey  cum_volume  cum_amount
424  SZ001872   4481541.0  84902793.88  2001872         NaN         NaN
426  SZ001914   5992060.0  61162179.75  2001914         NaN         NaN

2016-12-15
trade finished
15:21:20.252819

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   8828239.0  1.702971e+08  2001872         NaN         NaN
427  SZ001914  11849628.0  1.244622e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   8828239.0  1.702971e+08  2001872         NaN         NaN
427  SZ001914  11849628.0  1.244622e+08  2001914         NaN         NaN

2016-12-16
trade finished
15:26:35.368868

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   8617415.0  1.680283e+08  2001872         NaN         NaN
429  SZ001914   8947446.0  9.452443e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   8617415.0  1.680283e+08  2001872         NaN         NaN
429  SZ001914   8947446.0  9.452443e+07  2001914         NaN         NaN

2016-12-19
trade finished
15:31:29.379526

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   5889281.0  1.103873e+08  2001872         NaN         NaN
428  SZ001914  10099721.0  1.072168e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   5889281.0  1.103873e+08  2001872         NaN         NaN
428  SZ001914  10099721.0  1.072168e+08  2001914         NaN         NaN

2016-12-20
trade finished
15:36:22.439930

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   5357371.0  1.008018e+08  2001872         NaN         NaN
426  SZ001914  15082211.0  1.632389e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
424  SZ001872   5357371.0  1.008018e+08  2001872         NaN         NaN
426  SZ001914  15082211.0  1.632389e+08  2001914         NaN         NaN

2016-12-21
trade finished
15:41:15.898448

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   3882144.0  7.364615e+07  2001872         NaN         NaN
427  SZ001914  19481354.0  2.153637e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   3882144.0  7.364615e+07  2001872         NaN         NaN
427  SZ001914  19481354.0  2.153637e+08  2001914         NaN         NaN

2016-12-22
trade finished
15:46:00.980554

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872  11157774.0  2.184954e+08  2001872         NaN         NaN
427  SZ001914  15001821.0  1.631763e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872  11157774.0  2.184954e+08  2001872         NaN         NaN
427  SZ001914  15001821.0  1.631763e+08  2001914         NaN         NaN

2016-12-23
trade finished
15:50:55.567881

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872  11429903.0  2.284565e+08  2001872         NaN         NaN
429  SZ001914   7730596.0  8.300326e+07  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872  11429903.0  2.284565e+08  2001872         NaN         NaN
429  SZ001914   7730596.0  8.300326e+07  2001914         NaN         NaN

2016-12-26
trade finished
15:55:54.274083

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   6913190.0  1.376673e+08  2001872         NaN         NaN
428  SZ001914  18377092.0  2.054379e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
426  SZ001872   6913190.0  1.376673e+08  2001872         NaN         NaN
428  SZ001914  18377092.0  2.054379e+08  2001914         NaN         NaN

2016-12-27
trade finished
16:00:26.454015

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   6342126.0  1.235540e+08  2001872         NaN         NaN
429  SZ001914  10411156.0  1.164137e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
427  SZ001872   6342126.0  1.235540e+08  2001872         NaN         NaN
429  SZ001914  10411156.0  1.164137e+08  2001914         NaN         NaN

2016-12-28
trade finished
16:04:56.663366

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   4648499.0  9.041948e+07  2001872         NaN         NaN
424  SZ001914  36112713.0  4.321600e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
422  SZ001872   4648499.0  9.041948e+07  2001872         NaN         NaN
424  SZ001914  36112713.0  4.321600e+08  2001914         NaN         NaN

2016-12-29
trade finished
16:09:23.826907

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   3942104.0  7.566522e+07  2001872         NaN         NaN
427  SZ001914  34194832.0  4.200837e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
425  SZ001872   3942104.0  7.566522e+07  2001872         NaN         NaN
427  SZ001914  34194832.0  4.200837e+08  2001914         NaN         NaN

2016-12-30
trade finished
16:13:39.263612
          date     skey          time
0     20160509  2000001  150000000000
1     20160509  2000005  150000000000
2     20160509  2000006  150000000000
3     20160509  2000008  150000000000
4     20160509  2000009  150000000000
...        ...      ...           ...
1624  20161021  2002590  135644580000
1625  20161024  2300248  140138530000
1626  20161026  2300441  135119000000
1627  20161027  2000589  142217980000
1628  20161027  2002017  142219110000

[1629 rows x 3 columns]

In [12]:
import pymongo
import pandas as pd
import pickle
import datetime
import time
import gzip
import lzma
import pytz


def DB(host, db_name, user, passwd):
    auth_db = db_name if user not in ('admin', 'root') else 'admin'
    uri = 'mongodb://%s:%s@%s/?authSource=%s' % (user, passwd, host, auth_db)
    return DBObj(uri, db_name=db_name)


class DBObj(object):
    def __init__(self, uri, symbol_column='skey', db_name='white_db'):
        self.db_name = db_name
        self.uri = uri
        self.client = pymongo.MongoClient(self.uri)
        self.db = self.client[self.db_name]
        self.chunk_size = 20000
        self.symbol_column = symbol_column
        self.date_column = 'date'

    def parse_uri(self, uri):
        # mongodb://user:password@example.com
        return uri.strip().replace('mongodb://', '').strip('/').replace(':', ' ').replace('@', ' ').split(' ')

    def drop_table(self, table_name):
        self.db.drop_collection(table_name)

    def rename_table(self, old_table, new_table):
        self.db[old_table].rename(new_table)

    def write(self, table_name, df):
        if len(df) == 0: return

        multi_date = False

        if self.date_column in df.columns:
            date = str(df.head(1)[self.date_column].iloc[0])
            multi_date = len(df[self.date_column].unique()) > 1
        else:
            raise Exception('DataFrame should contain date column')

        collection = self.db[table_name]
        collection.create_index([('date', pymongo.ASCENDING), ('symbol', pymongo.ASCENDING)], background=True)
        collection.create_index([('symbol', pymongo.ASCENDING), ('date', pymongo.ASCENDING)], background=True)

        if multi_date:
            for (date, symbol), sub_df in df.groupby([self.date_column, self.symbol_column]):
                date = str(date)
                symbol = int(symbol)
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)
        else:
            for symbol, sub_df in df.groupby([self.symbol_column]):
                collection.delete_many({'date': date, 'symbol': symbol})
                self.write_single(collection, date, symbol, sub_df)

    def write_single(self, collection, date, symbol, df):
        for start in range(0, len(df), self.chunk_size):
            end = min(start + self.chunk_size, len(df))
            df_seg = df[start:end]
            version = 1
            seg = {'ver': version, 'data': self.ser(df_seg, version), 'date': date, 'symbol': symbol, 'start': start}
            collection.insert_one(seg)

    def build_query(self, start_date=None, end_date=None, symbol=None):
        query = {}

        def parse_date(x):
            if type(x) == str:
                if len(x) != 8:
                    raise Exception("`date` must be YYYYMMDD format")
                return x
            elif type(x) == datetime.datetime or type(x) == datetime.date:
                return x.strftime("%Y%m%d")
            elif type(x) == int:
                return parse_date(str(x))
            else:
                raise Exception("invalid `date` type: " + str(type(x)))

        if start_date is not None or end_date is not None:
            query['date'] = {}
            if start_date is not None:
                query['date']['$gte'] = parse_date(start_date)
            if end_date is not None:
                query['date']['$lte'] = parse_date(end_date)

        def parse_symbol(x):
            if type(x) == int:
                return x
            else:
                return int(x)

        if symbol:
            if type(symbol) == list or type(symbol) == tuple:
                query['symbol'] = {'$in': [parse_symbol(x) for x in symbol]}
            else:
                query['symbol'] = parse_symbol(symbol)

        return query

    def delete(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot delete the whole table')
            return None

        collection.delete_many(query)

    def read(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]

        query = self.build_query(start_date, end_date, symbol)
        if not query:
            print('cannot read the whole table')
            return None

        segs = []
        for x in collection.find(query):
            x['data'] = self.deser(x['data'], x['ver'])
            segs.append(x)
        segs.sort(key=lambda x: (x['symbol'], x['date'], x['start']))
        return pd.concat([x['data'] for x in segs], ignore_index=True) if segs else None

    def list_tables(self):
        return self.db.collection_names()

    def list_dates(self, table_name, start_date=None, end_date=None, symbol=None):
        collection = self.db[table_name]
        dates = set()
        if start_date is None:
            start_date = '00000000'
        if end_date is None:
            end_date = '99999999'
        for x in collection.find(self.build_query(start_date, end_date, symbol), {"date": 1, '_id': 0}):
            dates.add(x['date'])
        return sorted(list(dates))

    def ser(self, s, version):
        pickle_protocol = 4
        if version == 1:
            return gzip.compress(pickle.dumps(s, protocol=pickle_protocol), compresslevel=2)
        elif version == 2:
            return lzma.compress(pickle.dumps(s, protocol=pickle_protocol), preset=1)
        else:
            raise Exception('unknown version')

    def deser(self, s, version):
        def unpickle(s):
            return pickle.loads(s)

        if version == 1:
            return unpickle(gzip.decompress(s))
        elif version == 2:
            return unpickle(lzma.decompress(s))
        else:
            raise Exception('unknown version')


def patch_pandas_pickle():
    if pd.__version__ < '0.24':
        import sys
        from types import ModuleType
        from pandas.core.internals import BlockManager
        pkg_name = 'pandas.core.internals.managers'
        if pkg_name not in sys.modules:
            m = ModuleType(pkg_name)
            m.BlockManager = BlockManager
            sys.modules[pkg_name] = m
patch_pandas_pickle()
    
    


import pandas as pd
import random
import numpy as np
import glob
import os
import pickle
import datetime
import time
pd.set_option("max_columns", 200)

startTm = datetime.datetime.now()
readPath = 'A:\\day_stock\\***'
dataPathLs = np.array(glob.glob(readPath))
dataPathLs = dataPathLs[[np.array([os.path.basename(i).split('.')[0][:2] == 'SZ' for i in dataPathLs])]]
db = pd.DataFrame()
for p in dataPathLs:
    dayData = pd.read_csv(p, compression='gzip')
    db = pd.concat([db, dayData])
print(datetime.datetime.now() - startTm)

year = "2016"
startDate = '20160509'
endDate = '20160509'
readPath = 'L:\\' + year + '\\***\\Transaction\\SZ\\***'
dataPathLs = np.array(glob.glob(readPath))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
dataPathLs = dataPathLs[(dateLs >= startDate) & (dateLs <= endDate)]
date = np.unique(np.array([os.path.basename(i) for i in dataPathLs]))
dateLs = np.array([os.path.basename(i) for i in dataPathLs])
ll = []
problems = []

for d in date: 
    TradeLog = []
    path = dataPathLs[dateLs == d]
    for p in path:
        readPath = p + '\\***'
        datapath = np.array(glob.glob(readPath))
        dd = np.array([int(os.path.basename(i).split('.')[0]) for i in datapath])
        datapath = datapath[(dd < 4000) | ((dd > 300000) & (dd < 310000))]
        for i in datapath:
            try:
                df = pd.read_csv(i, encoding='GBK')
            except:
                print("empty data")
                print(i)
                ll.append(int(os.path.basename(i).split('.')[0]))
                continue
            TradeLog += [df]
    TradeLog = pd.concat(TradeLog).reset_index(drop=True)
    
    
    TradeLog = TradeLog.rename(columns={"FunctionCode": "trade_type", "TradePrice":"trade_price", "TradeVolume":"trade_qty",
                                       "BidOrder":"BidApplSeqNum", "Date":'date', "AskOrder":"OfferApplSeqNum"})
    TradeLog['skey'] = TradeLog['WindCode'].apply(lambda x: x.split('.')[0]).astype(int) + 2000000
    TradeLog["trade_type"] = np.where(TradeLog["trade_type"] == 'C', 4, 1)
    TradeLog["trade_flag"] = 0
    TradeLog['trade_price'] = (TradeLog['trade_price'] / 10000).round(2)
    TradeLog['trade_qty'] = TradeLog['trade_qty'] / 100
    TradeLog["trade_money"] = TradeLog["trade_price"] * TradeLog["trade_qty"]
    TradeLog['TransactTime'] = (TradeLog['date'] * 1000000000).astype('int64') + TradeLog['Time']
    TradeLog = TradeLog[TradeLog["TransactTime"].astype(str).str[12:14].astype(int) < 60]
    TradeLog["clockAtArrival"] = TradeLog["TransactTime"].astype(str).apply(lambda x: np.int64(datetime.datetime.strptime(x, '%Y%m%d%H%M%S%f').timestamp()*1e6))
    TradeLog['datetime'] = TradeLog["clockAtArrival"].apply(lambda x: datetime.datetime.fromtimestamp(x/1e6))
    TradeLog["time"] = TradeLog['Time'].astype(np.int64)*1000
    
    for col in ["skey", "date", "BidApplSeqNum", "OfferApplSeqNum", "trade_qty", "trade_type", "trade_flag"]:
        TradeLog[col] = TradeLog[col].astype('int32')
    for cols in ["trade_money"]:
        TradeLog[cols] = TradeLog[cols].round(2)
    
    da_te = str(TradeLog["date"].iloc[0]) 
    da_te = da_te[:4] + '-' + da_te[4:6] + '-' + da_te[6:8]
    db1 = db[db["date"] == da_te]
    sl = (db1["ID"].str[2:].astype(int) + 2000000).unique()
    db1["max_volume"] = db1.groupby("ID")["d_volume"].transform("max")
    db1["max_amount"] = db1.groupby("ID")["d_amount"].transform("max")
    t1 = db1.groupby("ID")["max_volume", "max_amount"].first().reset_index()
    del db1
    t1["skey"] = t1["ID"].str[2:].astype(int) + 2000000
    trade1 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_qty"].sum().reset_index()
    trade1.columns=["skey", "cum_volume"]
    trade2 = TradeLog[TradeLog["trade_type"] == 1].groupby("skey")["trade_money"].sum().reset_index()
    trade2.columns=["skey", "cum_amount"]
    t2 = pd.merge(trade1, trade2, on="skey")
    re = pd.merge(t1, t2, on="skey", how="outer")
    try:
        assert(t1.shape[0] == t2.shape[0])
        assert(re[re["cum_volume"] != re["max_volume"]].shape[0] == 0)
        assert(re[re["cum_amount"].round(2) != re["max_amount"]].shape[0] == 0)
    except:
        display(set(t1["skey"]) - set(t2["skey"]))
        display(re[re["cum_volume"] != re["max_volume"]])
        display(re[re["cum_amount"].round(2) != re["max_amount"]])
        re['date'] = d
        add = TradeLog[TradeLog['skey'].isin(re[(re["cum_amount"].round(2) != re["max_amount"]) & (~re['skey'].isin([2001872, 2001914]))]['skey'].unique())].groupby('skey')['time'].max().reset_index()
        problems += [pd.merge(re[(re["cum_amount"].round(2) != re["max_amount"]) & (~re['skey'].isin([2001872, 2001914]))], add, on='skey')[['date', 'skey', 'time']]]
    del t1
    del t2
    del re
    
    TradeLog['ApplSeqNum'] = 0
    TradeLog['ApplSeqNum'] = TradeLog['ApplSeqNum'].astype(int)
    TradeLog = TradeLog[["skey", "date", "time", "clockAtArrival", "datetime", "ApplSeqNum", "trade_type", "trade_flag",
                                                 "trade_price", "trade_qty", "BidApplSeqNum", "OfferApplSeqNum"]]
    print(da_te)
    print("trade finished")


    
    database_name = 'com_md_eq_cn'
    user = "zhenyuy"
    password = "bnONBrzSMGoE"

    db1 = DB("192.168.10.178", database_name, user, password)
    db1.write('md_trade', TradeLog)
    
    del TradeLog

    print(datetime.datetime.now() - startTm)
problems = pd.concat(problems).reset_index(drop=True)
print(problems)
problems.to_pickle(r'G:\\2016_trade_2.pkl')

C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:195: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.

0:04:24.819976

C:\Users\win\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:257: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\win\Anaconda3\lib\site-packages\ipykernel_launcher.py:258: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

{2001872, 2001914}

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
404  SZ001872   2783924.0  4.307159e+07  2001872         NaN         NaN
406  SZ001914  15901676.0  1.227501e+08  2001914         NaN         NaN

           ID  max_volume    max_amount     skey  cum_volume  cum_amount
404  SZ001872   2783924.0  4.307159e+07  2001872         NaN         NaN
406  SZ001914  15901676.0  1.227501e+08  2001914         NaN         NaN

2016-05-09
trade finished
0:10:50.509207
Empty DataFrame
Columns: [date, skey, time]
Index: []

In [15]:
d = pd.read_pickle(r'G:\\2016_order.pkl')
d.to_csv(r'G:\\2016_order.csv', index=False)